oatchidol/NurseAid/firmware/nurseaid_esp32.ino
/*
 * ═══════════════════════════════════════════════════════════════════
 *  NAid ESP32 BLE Node — port จาก iStyle28.py (Raspberry Pi) → ESP32
 * ═══════════════════════════════════════════════════════════════════
 *
 *  หน้าที่: เชื่อมนาฬิกา J-Style สูงสุด MAX_DEVICES เรือนพร้อมกัน
 *           อ่าน HR / Temp / SpO2 / Battery แล้วส่งขึ้น MQTT
 *           ด้วย topic + payload รูปแบบ "เดียวกับ" iStyle28.py ทุกประการ
 *           → Dashboard เดิมใช้ได้ทันที ไม่ต้องแก้ backend
 *
 *  สิ่งที่ต่างจากเวอร์ชัน Pi:
 *    • ไม่มี BlueZ → ปัญหา org.bluez.Error.InProgress ทั้งชุดหายไป
 *    • ไม่ต้องมี recovery 4 ขั้น → ถ้าระบบเสียจริง ESP.restart() จบ
 *    • จำกัด MAX_DEVICES = 3 ตามคำแนะนำของ Espressif ที่ว่า
 *      "ESP32 BLE สื่อสารได้เสถียรที่ 3 การเชื่อมต่อพร้อมกัน"
 *    • ไม่มี rotation — 3 เรือนต่อค้างไว้ตลอด ค่าอัปเดตต่อเนื่อง
 *
 *  ── LIBRARY ที่ต้องติดตั้ง (Arduino IDE → Library Manager) ──
 *    1. NimBLE-Arduino  เวอร์ชัน 2.x  (ทดสอบกับ 2.5.1)
 *       ⚠️ ต้องเป็น 2.x เท่านั้น — API 1.x ไม่ตรงกัน
 *    2. PubSubClient    เวอร์ชัน 2.8  (ของ Nick O'Leary)
 *
 *  ── บอร์ด ──
 *    ESP32 Dev Module (แนะนำ ESP32-WROOM-32U + เสาอากาศภายนอก)
 *    ⚠️ ห้ามใช้ ESP32-S2 (ไม่มี Bluetooth)
 *
 *  ── หมายเหตุ coexistence (WiFi + BLE ใช้ radio ตัวเดียวกัน) ──
 *    • scan window (96) < scan interval (160) เสมอ ไม่งั้น WiFi โดนอด
 *    • ไม่เรียก WiFi.setSleep(false) — modem sleep ช่วยแบ่งเวลาให้ BLE
 *    • เมื่อ slot เต็ม 3 เรือน จะ "หยุด scan" ทั้งหมด ลดการแย่ง radio
 */

#include <WiFi.h>
#include <PubSubClient.h>
#include <NimBLEDevice.h>
#include <time.h>
#include <Preferences.h>
#include <WiFiManager.h>
#include "esp_wpa2.h"       // WPA2-Enterprise (PEAP / TTLS) สำหรับเครือข่ายองค์กร
#include <ArduinoOTA.h>     // OTA แบบ push (สั่งจาก command line ด้วย espota.py ได้)
#include <HTTPUpdate.h>     // OTA แบบ pull (โหลด .bin จาก Pi เอง สั่งผ่าน MQTT)
#include <ESPmDNS.h>
#include <esp_task_wdt.h>   // watchdog ระดับชิป — รีเซ็ตเองเมื่อ loop() ค้าง
#include <esp_system.h>
#include <esp_mac.h>       // esp_read_mac() — อ่าน MAC เรียงถูกลำดับ

// ═══════════════════════════════════════════════════════════════════
// EMBEDDED METADATA — webapp อ่านจากไฟล์ .bin ได้ทันทีหลังอัปโหลด
//
//   webapp จะค้นหา magic string "NAidMETA" ในไฟล์ binary แล้วอ่าน
//   ฟิลด์ถัดไปตาม layout ที่ตรงกัน เพื่อแสดงข้อมูล config ก่อน deploy
//   ⚠️ ห้ามเปลี่ยนลำดับ/ขนาดฟิลด์ — webapp อ่านตาม offset ตายตัว
//      ถ้าต้องเพิ่มฟิลด์ ให้เพิ่มต่อท้าย reserved แล้วขึ้น metaVersion
// ═══════════════════════════════════════════════════════════════════
// ⚠️ forward-declare เท่านั้น — ค่าจริงอยู่หลัง #define CONFIG ด้านล่าง
//    เพราะ struct ต้องรู้จักก่อนที่ Arduino จะสร้าง prototype อัตโนมัติ
struct __attribute__((packed)) FirmwareMetadata {
    char     magic[8];          // "NAidMETA" — ใช้ค้นหาตำแหน่งใน binary
    uint8_t  metaVersion;       // เวอร์ชันของ struct นี้ (เริ่มที่ 1)
    char     fwVersion[24];     // เช่น "2.1.0"
    char     mqttBroker[48];    // เช่น "172.16.251.38"
    uint16_t mqttPort;          // เช่น 1883
    char     mqttBaseTopic[16]; // เช่น "ble"
    uint8_t  maxDevices;        // เช่น 8
    char     defaultSsid[33];   // SSID สำรอง
    char     buildDate[24];     // เช่น "Sep 10 2026"
    char     reserved[32];      // เผื่อเพิ่มฟิลด์ในอนาคต
};

// ═══════════════════════════════════════════════════════════════════
// CONFIG — แก้ส่วนนี้ก่อนอัพโหลด
// ═══════════════════════════════════════════════════════════════════

// --- WiFi (ต้องเป็น 2.4GHz — ESP32 ไม่รองรับ 5GHz) ---
// --- WiFi ---
//   ไม่ต้องแก้ SSID/รหัสในโค้ดอีกแล้ว — ตั้งผ่านหน้าเว็บตอนติดตั้งหน้างาน
//   ค่าที่ตั้งจะถูกเก็บใน NVS อยู่รอดข้ามการรีบูตและการอัปเดตเฟิร์มแวร์
//
//   ⚠️ ค่า 2 ตัวนี้เป็นแค่ "ค่าสำรองตอนบูตครั้งแรก" เท่านั้น
//      ถ้าต่อไม่ได้จะเปิดหน้าเว็บให้ตั้งค่าเอง
#define WIFI_SSID        "ksr_comp3"
#define WIFI_PASS        "1111100000"

// --- โหมดตั้งค่า WiFi ผ่านหน้าเว็บ ---
#define WM_AP_PASSWORD   "naidsetup"   // รหัสเข้า WiFi ตอนตั้งค่า (อย่างน้อย 8 ตัว)
#define WM_PORTAL_TIMEOUT_SEC   180    // ไม่มีใครเข้ามาตั้งค่าใน 3 นาที → เลิกรอ แล้วบูตใหม่
#define WM_CONNECT_TIMEOUT_SEC   20    // รอเชื่อม WiFi เดิมนานสุดกี่วินาที

// ปุ่ม BOOT บนบอร์ด (GPIO9 บน C3 / GPIO0 บนรุ่นอื่น) ใช้ล้างค่า WiFi
//   กดค้างไว้ตอนเสียบไฟ → เข้าโหมดตั้งค่าใหม่
//   จำเป็นเพราะถ้า WiFi เดิมใช้ไม่ได้ จะสั่งผ่าน MQTT ไม่ได้เลย
#if CONFIG_IDF_TARGET_ESP32C3
  #define WM_RESET_PIN     9
#else
  #define WM_RESET_PIN     0
#endif
#define WM_RESET_HOLD_MS  3000

// ═══════════════════════════════════════════════════════════════════
// รายชื่อ WiFi ที่โหนดรู้จัก (เก็บใน NVS)
//
//   ทำไมต้องเก็บหลายชุด:
//     ตอนโรงพยาบาลเปลี่ยน WiFi ถ้าโหนดจำได้ชุดเดียว พอของเก่าหาย = ออฟไลน์ทันที
//     แล้วสั่งค่าใหม่ผ่าน MQTT ไม่ได้เพราะไม่มีเน็ตแล้ว (ปัญหาไก่กับไข่)
//
//   ถ้าจำได้หลายชุด: เพิ่มชุดใหม่เข้าไป "ก่อน" วันเปลี่ยนจริง
//   พอของเก่าหาย โหนดจะย้ายไปเกาะชุดใหม่เองอัตโนมัติ ไม่ต้องมีใครไปยุ่ง
// ═══════════════════════════════════════════════════════════════════
#define WIFI_MAX_SAVED       5      // จำได้กี่ชุด
#define WIFI_TRY_TIMEOUT_MS  9000   // ลองแต่ละชุดนานสุดกี่ ms

// ── ชนิดการยืนยันตัวตนที่รองรับ ──
//   ไม่ใช้ WiFiMulti เพราะ addAP() รับได้แค่ ssid+รหัส ใช้กับ Enterprise ไม่ได้
//   จึงเขียนลูปลองเองเพื่อให้รองรับได้ทุกแบบในโค้ดชุดเดียว
enum WifiAuth : uint8_t {
    AUTH_PSK  = 0,   // WPA2/WPA3-PSK — รหัสเดียวร่วมกัน (แบบที่ใช้อยู่)
    AUTH_OPEN = 1,   // เครือข่ายเปิด ไม่มีรหัส
    AUTH_PEAP = 2,   // WPA2-Enterprise PEAP-MSCHAPv2 ← พบบ่อยสุดในองค์กร
    AUTH_TTLS = 3,   // WPA2-Enterprise EAP-TTLS (phase2 = MSCHAPv2)
};
static const char* AUTH_NAME[] = { "psk", "open", "peap", "ttls" };

// ⚠️ ต้องประกาศตรงนี้ (บนสุด) — Arduino สร้าง prototype ของฟังก์ชันอัตโนมัติ
//    ไว้ก่อนโค้ดของเรา ถ้า struct อยู่ล่างกว่านั้นจะคอมไพล์ไม่ผ่าน
struct WifiCred {
    String ssid, pass, identity, username;
    WifiAuth auth = AUTH_PSK;
};

// --- MQTT (ค่าเดียวกับ iStyle28.py) ---
#define MQTT_BROKER      "172.16.251.45"
#define MQTT_PORT        1883
#define MQTT_USER        "nursemon"
#define MQTT_PASS        "softTech^2"              // ← ใส่รหัสเดียวกับที่ตั้งใน env MQTT_PASS ของ Pi
#define MQTT_BASE_TOPIC  "ble"

