oatchidol/NurseAid/firmware/nurseaid_esp32.ino
// --- ประจำตัวโหนด (ตั้งไม่ซ้ำกันเมื่อมีหลายโหนด: node1, node2, ...) ---
// --- ชื่อประจำโหนด ---
//   ⚠️ ห้ามซ้ำกันเด็ดขาด เพราะเป็นส่วนหนึ่งของ MQTT topic
//      ถ้าซ้ำ: สั่ง reboot ตัวเดียวจะโดนทุกตัว · log ปนกัน · ข้อมูล retained ทับกัน
//
//   ปล่อยว่าง "" = ตั้งชื่อเองจาก MAC → แฟลชไฟล์เดียวกันได้ทุกเครื่อง
//   ใส่ชื่อ      = บังคับใช้ชื่อนั้น (เหมาะตอนทดสอบเครื่องเดียว)
#define NODE_ID_FIXED    ""

//   ชื่ออัตโนมัติใช้ 3 ไบต์ท้ายของ MAC เช่น "n8cd0a4" (7 ตัวอักษร)
//   ทดสอบแล้ว 100 เครื่องมีโอกาสชื่อชนกันเพียง 0.03%
//   (ตัดเหลือ 4 หลักจะสั้นลงแต่โอกาสชนพุ่งเป็น 7% — ไม่คุ้ม)
static char NODE_ID[24] = "";

// --- OTA / สั่งงานระยะไกล ---
#define FW_VERSION       "2.2.1"    // ส่งไปกับ heartbeat ใช้ยืนยันว่าอัปเดตสำเร็จจริง

#define OTA_PASSWORD     "naid-ota" // ⚠️ เปลี่ยนก่อนใช้จริง ใครรู้รหัสนี้อัปเฟิร์มแวร์เข้าเครื่องได้
static char TOPIC_CMD_NODE[64]     = "";   // เติมตอนบูตหลังรู้ NODE_ID
#define TOPIC_CMD_ALL    MQTT_BASE_TOPIC "/node/all/cmd"           // สั่งพร้อมกันทุกโหนด

// ═══════════════════════════════════════════════════════════════════
// การกู้ตัวเองเมื่อค้าง — เพื่อไม่ต้องเดินไปชักปลั๊กที่ห้องผู้ป่วย
// ═══════════════════════════════════════════════════════════════════
// ชั้นที่ 1: Task Watchdog ระดับชิป
//   ถ้า loop() ไม่กลับมา "ป้อนอาหาร" ภายในเวลาที่ตั้ง ชิปจะรีเซ็ตตัวเอง
//   ⚠️ ต้องตั้งมากกว่าเวลา block นานสุดใน loop หนึ่งรอบ ไม่งั้นจะรีเซ็ตทั้งที่ปกติ
//      วัดแล้วกรณีแย่สุด ~12 วิ (connect 8 + discovery 3 + อื่น ๆ) จึงตั้ง 30 วิ
#define WDT_TIMEOUT_SEC              30
#define BROKER_TRY_MAX_BOOTS         2       // ลองรวมกี่บูต ถ้าไม่ติด → กลับ broker เดิม
#define BROKER_CONFIRM_MS            120000  // ต้องต่อติดต่อเนื่องกี่ ms ก่อนยืนยันเป็นตัวหลัก
#define BROKER_TRIAL_DEADLINE_MS     900000  // ทดลองได้ไม่เกิน 15 นาที ไม่ผ่าน = ถอยกลับ

// ชั้นที่ 2: เน็ตหลุดยาว = รีบูต
//   ครอบคลุมเคสที่ chip ไม่ค้าง แต่ WiFi/MQTT stack เอ๋อจนต่อไม่ติดอีกเลย
#define NET_DEAD_REBOOT_MS   (10UL * 60UL * 1000UL)   // 10 นาที

// ชั้นที่ 3: รีบูตตามรอบ (0 = ปิด) — ล้าง heap fragmentation สะสม
#define AUTO_REBOOT_HOURS             0

// --- DEVICE REGISTRY ---
//     ⚠️ รายชื่อนี้เป็นแค่ "ค่าสำรองตอนบูตครั้งแรก" เท่านั้น
//        รายชื่อจริงมาจาก PostgreSQL ผ่าน MQTT retained message
//        ลำดับความสำคัญ:  MQTT (สดที่สุด) > NVS (ที่จำไว้) > รายชื่อด้านล่าง
static const char* FALLBACK_DEVICES[] = {
    /*"21:02:02:05:FF:9A",
    "21:02:02:05:F9:DD",
    "21:02:02:06:A0:63",
    "21:02:02:06:9F:20",
    "21:02:02:06:A0:F4",
    "03:02:02:08:29:96",
    "21:02:02:06:9F:7F",
    "00:00:13:A7:5D:18",*/
};
static const int NUM_FALLBACK = sizeof(FALLBACK_DEVICES) / sizeof(FALLBACK_DEVICES[0]);
#define MAX_REGISTERED   20      // เพดานรายชื่อที่เก็บได้ (คนละเรื่องกับจำนวนที่ต่อพร้อมกัน)

// --- หัวข้อ MQTT ที่ใช้รับรายชื่อจากฐานข้อมูล ---
//   ทั้งสองหัวข้อต้องส่งแบบ retained  → ESP32 ได้รายชื่อทันทีที่ต่อ broker ติด
//   ถ้ามีทั้งคู่ จะใช้ของเฉพาะโหนดก่อน (สำคัญมากเมื่อมีหลายโหนด จะได้ไม่แย่งเรือนเดียวกัน)
#define TOPIC_DEVICES_ALL   MQTT_BASE_TOPIC "/mac"          // รายชื่อรวมทุกโหนด
//   ⚠️ ต้องมี "/" คั่นก่อน NODE_ID ไม่งั้น C เชื่อมสตริงติดกันเป็น "ble/macslave1"
static char TOPIC_DEVICES_NODE[64] = "";   // เติมตอนบูตหลังรู้ NODE_ID

// --- หัวข้อ MQTT ที่ใช้รับ priority ต่อเรือนจากแอป (ดู PRIORITY_MEDIUM_INTERVAL_MS) ---
//   payload ยอมรับได้ทั้ง "AA:BB:CC:DD:EE:FF:high, 11:22:33:44:55:66:low" หรือ
//   JSON-ish "AA:BB:CC:DD:EE:FF":"high" — ตัวอ่านหา MAC ก่อนแล้วอ่านคำถัดไปเป็น priority
//   เรือนที่ไม่ถูกกล่าวถึงในข้อความนี้ = ไม่เปลี่ยนแปลง priority เดิม (ค่าเริ่มต้น = high)
#define TOPIC_PRIORITY_ALL   MQTT_BASE_TOPIC "/priority"
static char TOPIC_PRIORITY_NODE[64] = "";   // เติมตอนบูตหลังรู้ NODE_ID

// --- ⭐ จำกัดจำนวนเชื่อมต่อพร้อมกัน ---
//
//   ⚠️⚠️ ค่านี้ต้อง ≤ CONFIG_BT_NIMBLE_MAX_CONNECTIONS ของไลบรารี NimBLE
//        ซึ่งมีค่า default = 3
//
//   ❗ การใส่ #define CONFIG_BT_NIMBLE_MAX_CONNECTIONS ในไฟล์ .ino "ไม่มีผล"
//      เพราะไลบรารีถูกคอมไพล์แยกไปแล้วก่อนที่จะอ่านไฟล์นี้
//      ต้องไปแก้ที่ไฟล์ของไลบรารีโดยตรง:
//
//        Arduino/libraries/NimBLE-Arduino/src/nimconfig.h  บรรทัดราว ๆ 23
//        เปลี่ยนจาก   // #define CONFIG_BT_NIMBLE_MAX_CONNECTIONS 3
//        เป็น         #define CONFIG_BT_NIMBLE_MAX_CONNECTIONS 8     ← เอา // ออกด้วย
//
//      แก้แล้วต้องลบ cache การคอมไพล์ก่อน build ใหม่ ไม่งั้นจะใช้ของเก่า
//
//   ถ้าไม่แก้ nimconfig.h ให้ตั้ง MAX_DEVICES เป็น 3 แทน
#define MAX_DEVICES      8

// ── ค่าจริงของ metadata ที่ฝังลงใน .bin ──
//    ต้องอยู่หลัง #define ทั้งหมดที่ใช้เป็นค่าเริ่มต้น
//    attribute(used) กันคอมไพเลอร์ตัดทิ้ง (ไม่มีโค้ดอ้างถึงโดยตรง)
// retain จำเป็น — Arduino ESP32 ลิงก์ด้วย --gc-sections ลำพัง used กันได้แค่คอมไพเลอร์
static const FirmwareMetadata __attribute__((used, retain, section(".rodata")))
FIRMWARE_META = {
    {'N','A','i','d','M','E','T','A'},  // magic — ห้ามเปลี่ยน
    1,                                   // metaVersion
    FW_VERSION,                          // fwVersion
    MQTT_BROKER,                         // mqttBroker
    MQTT_PORT,                           // mqttPort
    MQTT_BASE_TOPIC,                     // mqttBaseTopic
    MAX_DEVICES,                         // maxDevices
    WIFI_SSID,                           // defaultSsid
    __DATE__,                            // buildDate (คอมไพเลอร์ใส่ให้)
    ""                                   // reserved
};
// ── ตัวดักตอนคอมไพล์: กันตั้งค่าขัดกันจนแครชหน้างาน ──
//    (ค่าจริงของไลบรารีถูกอ่านมาแล้วจาก nimconfig.h ตอน #include NimBLEDevice.h)
#if defined(CONFIG_BT_NIMBLE_MAX_CONNECTIONS) && (MAX_DEVICES > CONFIG_BT_NIMBLE_MAX_CONNECTIONS)
  #error "MAX_DEVICES มากกว่าเพดานของ NimBLE — เรือนที่เกินจะทำให้ createClient() คืน NULL แล้วแครช | แก้ไฟล์ NimBLE-Arduino/src/nimconfig.h บรรทัด ~23 ให้ CONFIG_BT_NIMBLE_MAX_CONNECTIONS เท่ากับ MAX_DEVICES (อย่าลืมเอา // ออก) แล้วลบ cache ก่อน build | หรือลด MAX_DEVICES ลงให้เท่าเพดาน"
#endif

// --- TIMING (มิลลิวินาที — ค่าเดียวกับ iStyle28.py ที่เป็นวินาที) ---
#define BLE_CONNECT_TIMEOUT_MS      8000   // ⚠️ connect() เป็น blocking — ค่านี้คือ "เพดานความช้า"
                                            //    ของการแจ้ง disconnect ทั้งโหนด เพราะ loop ติดอยู่ตรงนั้น
                                            //    ลดจาก 15s เหลือ 8s เพื่อให้ Dashboard อัปเดตไวขึ้น
                                            //    (เรือนที่ต่อไม่ติดใน 8 วิ มักต่อไม่ติดอยู่ดี)
#define PHASE1_DURATION_MS         120000   // Phase 1 (HR/Temp) 120 วิ
#define PHASE2_TIMEOUT_MS         75000   // รอผล SpO2 สูงสุด 75 วิ
                                            // ⚠️ ต้อง >= เวลาที่นาฬิกาใช้วัดจริงที่ช้าที่สุด
                                            //    วัดจากหน้างาน: 45 วิ (เร็วสุด) – 120 วิ (ช้าสุด)
                                            //    ถ้าตั้งน้อยกว่านี้ เคสที่วัดช้าจะไม่มีวันได้ค่าเลย
#define KEEPALIVE_INTERVAL_MS      30000   // ส่ง 0x41 ทุก 30 วิ
#define BATTERY_READ_INTERVAL_MS   60000   // ส่ง 0x13 ทุก 60 วิ
#define RSSI_READ_INTERVAL_MS      30000   // อ่าน+ส่ง RSSI ทุก 30 วิ
#define DATA_TIMEOUT_MS            30000   // watchdog ช่วง Phase 1: เงียบเกินนี้ = ตัดทิ้ง
// ⚠️ ช่วงวัด SpO2 ห้ามใช้ค่าข้างบน — นาฬิกาอาจเงียบยาวระหว่างวัด (45-120 วิ)
//    ถ้าใช้ค่าเดียวกัน watchdog จะตัดการเชื่อมต่อทิ้งกลางคันทุกครั้ง
//    ช่วงนั้นจึงมี watchdog ของตัวเอง = PHASE2_TIMEOUT + ระยะเผื่อ
//    (ไม่ได้ปิด watchdog ทิ้ง เพราะยังต้องกันเคส connection ค้างจริง)
#define PHASE2_WATCHDOG_GRACE_MS   30000   // เผื่อจาก PHASE2_TIMEOUT_MS

// เพดานรวมของ Phase 2 ทั้งหมด (นับรวมทุกรอบที่วัดซ้ำ)
//   จำเป็นเพราะ SPO2_LOW_RECHECK_MAX=3 คูณกับ PHASE2_TIMEOUT=120 วิ
//   ทำให้กรณีแย่สุดกิน 6 นาที ซึ่ง "ไม่มี HR/Temp ส่งออกเลย" ตลอดช่วงนั้น
//   ครบเพดานนี้เมื่อไหร่ให้กลับ Phase 1 ทันที ไม่วัดซ้ำต่อ
#define PHASE2_TOTAL_BUDGET_MS    180000   // 3 นาที
#define MQTT_PUBLISH_INTERVAL_MS    1000   // rate limit ต่อ (mac, key)
#define ESP32_STATUS_INTERVAL_MS   30000   // ความถี่ส่งสถานะโหนดไป ble/esp32
#define STALE_DEVICE_MS            30000   // ไม่เห็น advertisement เกินนี้ = ไม่อยู่ในระยะ
#define CONNECT_STAGGER_MS          1500   // เว้นระยะระหว่างการ connect แต่ละเรือน
#define FAIL_COUNT_FOR_COOLDOWN        5   // fail ครบแล้วพัก
#define COOLDOWN_MS                60000
#define RSSI_MIN_THRESHOLD           -85   // สัญญาณอ่อนกว่านี้ไม่พยายามต่อ
                                            // ⚠️ FIX (debug session นี้): คืนจาก -100 กลับเป็น -85
                                            //    -100 dBm อยู่เกือบชิดพื้น noise — พยายามต่อกับ
                                            //    เรือนที่สัญญาณอ่อนขนาดนั้นมีโอกาสสูงที่จะ connect
                                            //    fail/หลุดกลางคัน ยิ่งเพิ่มอาการ "หลุดบ่อย"
// (ห้ามใส่ CONFIG_BT_NIMBLE_MAX_CONNECTIONS ตรงนี้ — ไม่มีผล ดูหมายเหตุที่ MAX_DEVICES)

// ═══════════════════════════════════════════════════════════════════
// PRIORITY — ปรับความถี่การวัดตาม priority ที่แอปตั้ง (ประหยัดแบตนาฬิกา)
//
//   high   : เหมือนพฤติกรรมเดิมทั้งหมด — ค้างเชื่อมต่อตลอด วนรอบไม่จบ
//   medium/low : วัดครบ 1 รอบ (HR/Temp+SpO2) แล้ว "ตัดการเชื่อมต่อ" ทันที
//                คืน slot ให้เรือนอื่น แล้วรอครบ interval ค่อยต่อกลับมาวัดใหม่
//                ช่วงที่ไม่ได้เชื่อมต่อ = ไม่มี BLE radio ค้าง + ไม่มี LED PPG
//                ทำงาน ซึ่งเป็นตัวกินแบตหลักของนาฬิกา
//
//   ⚠️ ค่าเริ่มต้นของทุกเรือนคือ high เสมอ (ดู RegDevice.priority ด้านล่าง)
//      ถ้าแอปไม่เคยส่ง priority มาเลย ระบบจะทำงานเหมือนก่อนมี feature นี้ทุกประการ
#define PRIORITY_MEDIUM_INTERVAL_MS    (5UL * 60UL * 1000UL)   // 5 นาที
#define PRIORITY_LOW_INTERVAL_MS      (10UL * 60UL * 1000UL)   // 10 นาที
// สถานะ 2 = "ยังจับคู่อยู่ แค่พักตามรอบ priority" — ต่างจาก 0 ที่แปลว่าหลุด/ถอดออก
#define WEARABLE_STATUS_RESTING        2

// --- SPO2 LOW ALERT (เหมือน Pi) ---
#define SPO2_LOW_THRESHOLD            95   // ต่ำกว่านี้ → วัดซ้ำทันที
#define SPO2_LOW_RECHECK_MAX           3
#define SPO2_LOW_RECHECK_DELAY_MS   2000

