oatchidol/NurseAid/firmware/nurseaid_esp32.ino
// --- OFF-WRIST DETECTION (เหมือน Pi) ---
#define TEMP_VALID_MIN              20.0f
#define TEMP_OFFWRIST_SUSPECT       29.0f
#define TEMP_OFFWRIST_DEFINITE      25.0f   // เกณฑ์สัมบูรณ์ — ใช้เป็นตาข่ายชั้นสุดท้ายเท่านั้น
#define HR_ZERO_OFFWRIST_MS        45000
#define OFFWRIST_DEBOUNCE_COUNT        3

// ── ตรวจจับการถอดสายรัดแบบใหม่ (เร็วกว่าและไม่ขึ้นกับอุณหภูมิห้อง) ──
//
//   ⚠️ เกณฑ์สัมบูรณ์ temp<25°C ใช้ไม่ได้จริงในห้องแอร์
//      เพราะสายรัดจะเย็นลงเข้าหาอุณหภูมิห้องเท่านั้น ไม่มีทางต่ำกว่านั้น
//      ห้องแอร์ 26°C → temp ลงไปได้ต่ำสุด ~26°C → ไม่มีวันแตะ 25°C → ตรวจไม่เจอตลอดกาล
//
//   ⚠️ เกณฑ์ "HR=0 นาน 45 วิ" ก็ใช้ไม่ได้เช่นกัน
//      เพราะจากการวัดหน้างาน พอถอดออกแล้ว HR ไม่เป็น 0 แต่ "ค้างที่ค่าล่าสุด"
//      ทำให้ heart>0 เสมอ → ตัวจับเวลาถูกรีเซ็ตทุกเฟรม → เงื่อนไขนี้ตายสนิท
//
//   จึงเปลี่ยนมาใช้สัญญาณที่วัดได้จริง 2 อย่าง:
//     ① HR ค้างค่าเดิมเป๊ะ ๆ ติดกันหลายครั้ง — ตอนสวมอยู่ค่าจะแกว่งเสมอ
//     ② อุณหภูมิ "ลดลงจากค่าฐาน" (ไม่ใช่ค่าสัมบูรณ์) → ใช้ได้ทุกอุณหภูมิห้อง
//   หมายเหตุ: สัญญาณ HR ค้างเป็นแค่ "ตัวประกอบ" ไม่ใช่ตัวตัดสิน
//   เพราะถ้านาฬิกาอัปเดต HR ช้ากว่าอัตราการส่งเฟรม ค่าก็จะซ้ำเป็นปกติอยู่แล้ว
//   ตัวที่กันแจ้งผิดจริงคือ TEMP_DROP_WITH_HR ด้านล่าง
#define HR_FROZEN_SAMPLES             10   // HR ซ้ำเป๊ะกี่ครั้งถึงถือว่า sensor ไม่อ่านแล้ว
//   ⚠️ ค่านี้คือ "ตัวกันแจ้งผิด" ตัวจริง ไม่ใช่ HR_FROZEN_SAMPLES
//      ทดสอบแล้วพบว่า 0.8 จะแจ้งผิดตอนผู้ป่วยเอาแขนออกนอกผ้าห่ม
//      (อุณหภูมิลด 1.5°C ใน 2 นาที → แจ้งผิดที่ 106 วิ)
//      ปรับเป็น 1.2 แล้วไม่แจ้งผิด แลกกับตรวจถอดจริงช้าลงจาก 20 → 31 วิ
//      ถ้าต้องการไวขึ้นอีก ลดเป็น 1.0 ได้ (25 วิ) แต่เหลือระยะปลอดภัยน้อยลง
#define TEMP_DROP_WITH_HR          1.2f    // ลดจากฐานเท่านี้ + HR ค้าง = ถอดแล้ว
#define TEMP_DROP_ALONE            2.0f    // ลดจากฐานมากขนาดนี้ = ถอดแล้ว (ไม่ต้องดู HR)
#define TEMP_BASELINE_FALL_ALPHA   0.01f   // ค่าฐานไล่ตามขาลงช้า ๆ (ขาขึ้นตามทันที)

// ── เกณฑ์ "สวมกลับ" ต้องแยกจากเกณฑ์ "ถอด" (hysteresis) ──
//   ⚠️ ห้ามใช้เกณฑ์เดียวกันทั้งสองทาง เพราะจะเกิดบั๊กนี้:
//      ถอดวางทิ้งไว้ → สายรัดเย็นลงเรื่อย ๆ จนเท่าอุณหภูมิห้องแล้วหยุด
//      → ค่าฐานไล่ตามมาบรรจบ → ส่วนต่างหดเหลือ 0
//      → ระบบเข้าใจผิดว่า "สวมกลับแล้ว" ทั้งที่ยังวางอยู่บนโต๊ะ
//   จึงต้องใช้ "หลักฐานเชิงบวก" ว่าสวมกลับจริง คืออุณหภูมิต้องสูงขึ้น
#define TEMP_RISE_BACK             1.0f    // ต้องสูงขึ้นจากจุดต่ำสุดเท่านี้
#define TEMP_WEAR_MIN             30.0f    // และต้องถึงระดับที่สัมผัสผิวจริงเท่านั้น
#define ONWRIST_DEBOUNCE_COUNT        3

// ── ต้องมี "ชีพจรที่มีชีวิต" ด้วย ถึงจะถือว่าสวมกลับ ──
//   เหตุผล: อุณหภูมิอย่างเดียวหลอกได้ง่ายมาก
//     • ความร้อนจากไฟ PPG ตอนวัด HR/SpO2 (LED อยู่ติดเซ็นเซอร์วัดอุณหภูมิ)
//     • ความร้อนจากวิทยุ BLE ตอนสตรีมข้อมูล
//     • วางบนที่อุ่น / โดนแดด / มีคนหยิบจับ
//   แต่ค่า HR จะ "แกว่ง" ได้ก็ต่อเมื่อมีเลือดไหลผ่านใต้เซ็นเซอร์จริงเท่านั้น
//
//   ⚠️ ต้องดู "การเปลี่ยนแปลง" ไม่ใช่ "มีค่าหรือไม่"
//      เพราะตอนถอดออก HR ไม่เป็น 0 แต่ค้างที่ค่าล่าสุด → มีค่าเสมอ
#define HR_CHANGES_FOR_ONWRIST        3     // ต้องเปลี่ยนค่ากี่ครั้ง
#define HR_LIVE_WINDOW_MS         30000     // ภายในกี่มิลลิวินาที
#define HR_PLAUSIBLE_MIN             40     // ช่วงชีพจรที่เป็นไปได้ของคน
#define HR_PLAUSIBLE_MAX            180

// ── ถอดไว้นานเกินกำหนด → ตัดการเชื่อมต่อคืน slot ให้เรือนอื่น ──
#define OFFWRIST_DISCONNECT_MS  (10UL * 60UL * 1000UL)   // 10 นาที
#define OFFWRIST_RECHECK_MS     (3UL * 60UL * 1000UL)    // เว้นก่อนกลับมาตรวจใหม่
#define HR_FREEZE_AFTER_SPO2_MS    30000

// --- J-STYLE GATT (เหมือน Pi) ---
static const NimBLEUUID UUID_SERVICE("fff0");
static const NimBLEUUID UUID_TX("fff6");        // เขียนคำสั่ง
static const NimBLEUUID UUID_RX("fff7");        // รับ notification

// --- NTP (ใช้ประทับเวลาใน payload ให้เหมือน Pi) ---
//     ถ้าโรงพยาบาลบล็อก NTP เวลาจะค้างปี 1970 — backend ควรใช้เวลารับเป็นหลัก
#define NTP_SERVER1      "172.16.0.7"
#define NTP_SERVER2      "time.google.com"
#define TZ_OFFSET_SEC    (7 * 3600)             // ไทย UTC+7
#define NTP_SYNC_TIMEOUT_MS       10000         // รอ sync ตอนบูตนานสุด
#define NTP_RESYNC_INTERVAL_MS  3600000         // เทียบเวลาใหม่ทุก 1 ชม. (กันนาฬิกาชิปดริฟต์)

// ═══════════════════════════════════════════════════════════════════
// STATE
// ═══════════════════════════════════════════════════════════════════

// ── สถานะของแต่ละขั้นใน hybrid cycle (แทน while-loop ของ Python ด้วย FSM
//    เพราะบน Arduino ห้าม block นาน ไม่งั้นเรือนอื่น + MQTT จะค้างตาม) ──
enum SlotPhase : uint8_t {
    PH_FREE = 0,        // ช่องว่าง
    PH_SETUP,           // เพิ่งต่อติด รอ notify พร้อม (2 วิ) แล้วเริ่ม Phase 1
    PH_PHASE1,          // สตรีม HR/Temp
    PH_P2_STOPPING,     // ส่ง stop 0x09 แล้วรอ 1.5 วิ
    PH_P2_MEASURING,    // ส่ง start SpO2 แล้วรอผล
    PH_P2_ENDING,       // ส่ง stop SpO2 แล้วรอ 1.5 วิ ก่อนตัดสินใจ
    PH_P2_RECHECK_WAIT, // SpO2 ต่ำ → หน่วง 2 วิ ก่อนวัดซ้ำ
};

// ── กุญแจ MQTT ที่ส่ง (ใช้ index ทำ rate-limit ราคาถูก) ──
enum PubKey : uint8_t { K_HEART = 0, K_TEMP, K_SPO2, K_BATT, K_STATUS, K_RSSI, K_COUNT };
static const char* PUB_KEY_NAME[K_COUNT] = { "heart", "temp", "spo2", "batt", "status", "rssi" };

// ── priority การวัด ต่อเรือน (ตั้งจากแอป ผ่าน MQTT — ดูหมายเหตุที่ PRIORITY_MEDIUM_INTERVAL_MS) ──
enum Priority : uint8_t { PRIORITY_HIGH = 0, PRIORITY_MEDIUM = 1, PRIORITY_LOW = 2 };
static const char* PRIORITY_NAME[] = { "high", "medium", "low" };

struct DeviceSlot {
    bool     inUse = false;
    int      regIdx = -1;                  // ชี้กลับไปที่ registry
    NimBLEClient* client = nullptr;
    NimBLERemoteCharacteristic* txChar = nullptr;
    char     macUp[18];                    // ตัวพิมพ์ใหญ่ ใช้ใน payload ให้ตรงกับฝั่ง Pi

    SlotPhase phase = PH_FREE;
    uint32_t phaseAt = 0;                  // เวลาเข้าสถานะปัจจุบัน (millis)

    // ตัวจับเวลางานประจำ
    uint32_t lastData = 0, lastKeepalive = 0, lastBatt = 0, lastRssi = 0;

    // off-wrist / freeze (ตรรกะเดียวกับ Python)
    uint32_t hrZeroStart = 0;              // 0 = ไม่ได้นับอยู่
    int      lastHeart = -1;               // ค่า HR ครั้งก่อน (ใช้ดูว่าค้างไหม)
    uint16_t hrSameCount = 0;              // HR ซ้ำเป๊ะติดกันกี่ครั้ง
    float    tempBaseline = 0.0f;          // ค่าฐานอุณหภูมิตอนสวมอยู่
    float    tempFloor = 0.0f;             // อุณหภูมิต่ำสุดที่เจอระหว่างถอด
    bool     tempFloorInit = false;        // ตั้งค่า tempFloor แล้วหรือยัง
    uint8_t  onWristCount = 0;             // debounce ขาสวมกลับ
    uint32_t hrChangeAt[HR_CHANGES_FOR_ONWRIST] = {0};  // เวลาที่ HR เปลี่ยนค่า (วนทับ)
    uint32_t hrChangeSeq = 0;              // นับจำนวนครั้งที่เปลี่ยนทั้งหมด
    uint32_t offWristSince = 0;            // เวลาที่เริ่มถอด (0 = ยังสวมอยู่)
    bool     tempBaseInit = false;
    uint8_t  offWristCount = 0;
    bool     isWearing = true;
    bool     inSpo2 = false;
    uint8_t  lastSpo2 = 0;
    volatile bool spo2Ready = false;       // เซ็ตจาก notify callback
    uint16_t p2Frames = 0;                 // นับ frame ที่ได้รับระหว่างวัด SpO2 (ใช้วินิจฉัย)
    uint32_t p2Silence = 0;                // ช่วงเงียบยาวสุดระหว่างวัด (ms)
    uint32_t p2LastFrame = 0;
    uint32_t p2StartedAt = 0;              // เวลาที่เข้า Phase 2 ครั้งแรก (นับรวมทุกรอบวัดซ้ำ)
    uint32_t lastSpo2End = 0;
    uint8_t  spo2Recheck = 0;

    // ธงจาก BLE callback (ทำงานคนละ task — ห้ามเคลียร์ทรัพยากรใน callback)
    volatile bool gone = false;

