oatchidol/NurseAid/firmware/nurseaid_esp32.ino
    uint32_t lastPub[K_COUNT] = {0};       // rate limit ต่อ key
};
static DeviceSlot slots[MAX_DEVICES];

// ── ทะเบียนนาฬิกา (สถานะการค้นพบ + cooldown ต่อเรือน) ──
struct RegDevice {
    char macUp[18];
    char macLow[18];
    NimBLEAddress addr;
    volatile uint32_t lastSeen = 0;        // millis ที่เห็น advertisement ล่าสุด
    volatile int rssi = -127;
    bool inSlot = false;
    uint8_t failCount = 0;
    uint32_t nextAttempt = 0;              // ห้ามลองก่อนเวลานี้ (backoff/cooldown)
    bool lastOffWrist = false;             // สถานะ "ถอดแล้ว" ครั้งล่าสุด
                                           //   ⚠️ ต้องเก็บที่ทะเบียน ไม่ใช่ที่ slot
                                           //   เพราะ slot ถูกล้างทุกครั้งที่ต่อใหม่
                                           //   ถ้าไม่เก็บ พอ reconnect จะกลับเป็น "สวมอยู่"
                                           //   แล้วส่ง temp จริงออกไป = ค่าเด้งบน Dashboard
    uint8_t priority = PRIORITY_HIGH;      // ตั้งจากแอป — ค่าเริ่มต้น high = พฤติกรรมเดิมทุกประการ
};
static RegDevice registry[MAX_REGISTERED];
static int  numRegistered = 0;             // จำนวนจริงที่ใช้อยู่
static bool haveNodeList  = false;         // เคยได้รายชื่อเฉพาะโหนดแล้วหรือยัง
static bool sawAppRoster  = false;        // เคยได้รายชื่อ MAC จากแอปเราบน broker นี้แล้วหรือยัง
static bool listDirty     = true;          // ต้องรายงานรายชื่อปัจจุบันกลับขึ้น MQTT
static Preferences prefs;

// ── คิวส่ง frame จาก BLE callback → loop() ──
//    notify มาบน task ของ NimBLE ถ้า publish MQTT ตรงนั้นจะชนกับ loop()
//    (PubSubClient ไม่ thread-safe) จึงส่งผ่านคิวมาประมวลผลใน loop แทน
struct BleFrame { uint8_t slot; uint8_t len; uint8_t data[28]; };
static QueueHandle_t frameQueue;

static WiFiClient   wifiClient;
static PubSubClient mqtt(wifiClient);

static uint32_t lastConnectAttempt = 0;    // stagger การ connect
static uint32_t lastMqttAttempt = 0;
static uint32_t lastHeartbeat = 0;
static uint32_t lastStatusLog = 0;
static bool     scanRunning = false;

// ═══════════════════════════════════════════════════════════════════
// HELPERS
// ═══════════════════════════════════════════════════════════════════

static void macToUpper(const char* in, char* out) {
    for (int i = 0; i < 17 && in[i]; i++) out[i] = toupper(in[i]);
    out[17] = 0;
}
static void macToLower(const char* in, char* out) {
    for (int i = 0; i < 17 && in[i]; i++) out[i] = tolower(in[i]);
    out[17] = 0;
}

// สร้าง frame คำสั่ง 16 ไบต์: 15 ไบต์แรก + checksum (ผลรวม & 0xFF)
// — เหมือน _create_command ของ Python เป๊ะ
static void buildCmd(const uint8_t* bytes, size_t n, uint8_t out[16]) {
    memset(out, 0, 16);
    memcpy(out, bytes, n > 15 ? 15 : n);
    uint8_t crc = 0;
    for (int i = 0; i < 15; i++) crc += out[i];
    out[15] = crc;
}

// เขียนคำสั่งไปที่ TX — คืน false ถ้าเขียนไม่ได้ (มักแปลว่าหลุดแล้ว)
static bool writeCmd(DeviceSlot& s, std::initializer_list<uint8_t> bytes) {
    if (!s.txChar || s.gone) return false;
    uint8_t frame[16];
    uint8_t tmp[15]; size_t i = 0;
    for (uint8_t b : bytes) { if (i < 15) tmp[i++] = b; }
    buildCmd(tmp, i, frame);
    if (!s.txChar->writeValue(frame, 16, false)) {
        Serial.printf("[W] %s เขียนคำสั่งไม่ได้ (หลุดแล้ว?)\n", s.macUp);
        return false;
    }
    return true;
}

// ประทับเวลาแบบเดียวกับ Python: "YYYY-MM-DD HH:MM:SS"

static void timeStr(char* out, size_t n) {
    time_t now = time(nullptr);
    // ถ้ายังไม่ได้เทียบเวลา อย่าส่งปี 1970 ออกไปเงียบ ๆ
    // ให้ส่งค่าที่ฝั่งเซิร์ฟเวอร์มองออกทันทีว่า "เวลานี้เชื่อไม่ได้"
    if (now < 1600000000) {
        snprintf(out, n, "1970-01-01 00:00:00");
        return;
    }
    struct tm tmv;
    localtime_r(&now, &tmv);
    strftime(out, n, "%Y-%m-%d %H:%M:%S", &tmv);
}
static bool timeSynced() { return time(nullptr) > 1600000000; }   // > ปี 2020 = sync แล้ว

// uuid4 จาก esp_random() (แทน uuid.uuid4() ของ Python)
static void makeUuid(char* out37) {
    uint32_t a = esp_random(), b = esp_random(), c = esp_random(), d = esp_random();
    snprintf(out37, 37, "%08lx-%04lx-4%03lx-%04lx-%04lx%08lx",
             (unsigned long)a,
             (unsigned long)(b >> 16),
             (unsigned long)(b & 0x0FFF),
             (unsigned long)(0x8000 | ((c >> 16) & 0x3FFF)),
             (unsigned long)(c & 0xFFFF),
             (unsigned long)d);
}

// ═══════════════════════════════════════════════════════════════════
// DEVICE LIST — รับรายชื่อ MAC จากฐานข้อมูลผ่าน MQTT retained message
//
//   ทำไมไม่ใช้การ poll ทุก 10-15 วิ:
//     • retained message มาถึงภายใน ~1 วินาทีหลังแก้ใน DB (เร็วกว่า 10-15 วิ)
//     • ไม่ต้องยิงคำขอซ้ำๆ  → ประหยัดเวลาใช้คลื่นที่ต้องแบ่งกับ BLE
//     • broker เก็บข้อความไว้ให้ → โหนดที่เพิ่งบูตได้รายชื่อทันทีที่ต่อติด
//     • ไม่ต้องเปิด endpoint HTTP เพิ่ม
// ═══════════════════════════════════════════════════════════════════
static int findRegistry(const char* macUp) {
    for (int i = 0; i < numRegistered; i++)
        if (strcmp(registry[i].macUp, macUp) == 0) return i;
    return -1;
}

static bool addToRegistry(const char* mac) {
    if (numRegistered >= MAX_REGISTERED) return false;
    if (strlen(mac) != 17) return false;                 // ต้องเป็น AA:BB:CC:DD:EE:FF
    char up[18]; macToUpper(mac, up);
    if (findRegistry(up) >= 0) return false;             // กันซ้ำ
    RegDevice& r = registry[numRegistered];
    r = RegDevice();
    macToUpper(mac, r.macUp);
    macToLower(mac, r.macLow);
    numRegistered++;
    return true;
}

// ตัดการเชื่อมต่อของเรือนที่ถูกถอดออกจากรายชื่อ
static void dropSlotByRegIdx(int regIdx);

// ── ดึง MAC ออกจาก payload โดยไม่สนรูปแบบ ──
//    รองรับทุกแบบที่ฝั่งเว็บส่งมาได้ตามสะดวก:
//      CSV        : "AA:BB:CC:DD:EE:01,AA:BB:CC:DD:EE:02"
//      JSON array : ["AA:BB:CC:DD:EE:01","AA:BB:CC:DD:EE:02"]
//      ขึ้นบรรทัดใหม่ / เว้นวรรค / มีวงเล็บปีกกาครอบ ก็ได้หมด
//
//    ⚠️ ข้อตกลง: ส่งมาเฉพาะ MAC ที่ต้องการให้โหนดนี้เชื่อมเท่านั้น
//       อย่าใส่ MAC อื่นปนมาในข้อความเดียวกัน (เช่น รายการที่เพิ่งลบ)
//       เพราะตัวดึงจะเก็บ MAC ทุกตัวที่เจอในข้อความ
static bool isMacAt(const char* p) {
    for (int i = 0; i < 17; i++) {
        if (i % 3 == 2) { if (p[i] != ':' && p[i] != '-') return false; }
        else            { if (!isxdigit((unsigned char)p[i]))       return false; }
    }
    // ต้องไม่มีตัวอักษร hex ต่อท้าย (กันจับพลาดจากสตริงที่ยาวกว่า)
    return !isxdigit((unsigned char)p[17]);
}

static int extractMacs(const char* payload, char out[][18], int maxOut) {
    int n = 0;
    size_t len = strlen(payload);
    for (size_t i = 0; i + 17 <= len && n < maxOut; ) {
        if (isMacAt(payload + i)) {
            for (int k = 0; k < 17; k++) {
                char c = payload[i + k];
                out[n][k] = (k % 3 == 2) ? ':' : toupper((unsigned char)c);   // แปลง - เป็น : ด้วย
            }
            out[n][17] = 0;
            n++;
            i += 17;
        } else {
            i++;
        }
    }
    return n;
}

// นำรายชื่อใหม่มาใช้ "ทันที" โดยไม่ต้องรีบูต
//   - เรือนที่ถูกลบออก → ตัดการเชื่อมต่อทิ้ง
//   - เรือนที่เพิ่มเข้ามา → เริ่มค้นหาและเชื่อมต่อในรอบถัดไป
//   - เรือนที่ยังอยู่เหมือนเดิม → ไม่แตะต้อง (ไม่ให้ข้อมูลขาดช่วง)
static bool applyDeviceList(const char* payload, const char* src) {
    char incoming[MAX_REGISTERED][18];
    int  nIn = extractMacs(payload, incoming, MAX_REGISTERED);

    if (nIn == 0) {
        // ป้องกันข้อมูลเสีย/ข้อความว่างมาล้างทะเบียนจนระบบตายทั้งวอร์ด
        Serial.printf("[LIST] จาก %s ไม่พบ MAC ที่ใช้ได้เลย — คงรายชื่อเดิมไว้\n", src);
        return false;
    }

    // ── ถอดเรือนที่ไม่อยู่ในรายชื่อใหม่ ──
    int removed = 0;
    for (int i = numRegistered - 1; i >= 0; i--) {
        bool keep = false;
        for (int j = 0; j < nIn; j++)
            if (strcmp(registry[i].macUp, incoming[j]) == 0) { keep = true; break; }
        if (keep) continue;

        Serial.printf("[LIST] ถอด %s ออกจากทะเบียน\n", registry[i].macUp);
        dropSlotByRegIdx(i);                     // ตัดการเชื่อมต่อถ้ากำลังต่ออยู่
        for (int k = i; k < numRegistered - 1; k++) registry[k] = registry[k + 1];
        numRegistered--;
        removed++;
        // index ของ slot ที่ชี้มาที่ registry ต้องเลื่อนตาม
        for (auto& s : slots) if (s.inUse && s.regIdx > i) s.regIdx--;
    }

    // ── เพิ่มเรือนใหม่ ──
    int added = 0;
    for (int j = 0; j < nIn; j++)
        if (addToRegistry(incoming[j])) { added++; Serial.printf("[LIST] เพิ่ม %s\n", incoming[j]); }

    Serial.printf("[LIST] อัปเดตจาก %s → รวม %d เรือน (เพิ่ม %d ถอด %d)\n",
                  src, numRegistered, added, removed);

    // จำไว้ใน NVS เผื่อบูตครั้งหน้าตอน broker ยังไม่พร้อม
    // เก็บเป็น CSV ที่ normalize แล้ว ไม่ใช่ payload ดิบ (เล็กกว่าและอ่านง่ายกว่า)
    String store;
    for (int i = 0; i < numRegistered; i++) {
        if (i) store += ",";
        store += registry[i].macUp;
    }
    prefs.begin("naid", false);
    prefs.putString("devices", store);
    prefs.end();

    listDirty = true;        // ให้รายงานกลับขึ้น MQTT ในรอบถัดไป
    return true;
}

