oatchidol/NurseAid/firmware/nurseaid_esp32.ino
// ── รับ priority ต่อเรือนจากแอป ──
//   ใช้ isMacAt() ตัวเดิมหา MAC ในข้อความ แล้วอ่านคำถัดไปเป็น priority
//   (h.../high → HIGH, m.../medium → MEDIUM, l.../low → LOW, อื่น ๆ/ไม่มี → HIGH)
//   ⚠️ ค่าที่จำแนกไม่ได้ตีเป็น HIGH เสมอ — ปลอดภัยกว่า (พลาดไปวัดถี่เกินดีกว่าห่างเกิน)
//   MAC ที่ยังไม่อยู่ในทะเบียน (จาก applyDeviceList) จะถูกข้าม — priority ไม่สร้างเรือนใหม่เอง
static Priority parsePriorityWord(const char* p, size_t len) {
    if (len == 0) return PRIORITY_HIGH;
    switch (tolower((unsigned char)p[0])) {
        case 'm': return PRIORITY_MEDIUM;
        case 'l': return PRIORITY_LOW;
        default:  return PRIORITY_HIGH;
    }
}

static bool applyPriorityList(const char* payload, const char* src) {
    size_t len = strlen(payload);
    int applied = 0;
    for (size_t i = 0; i + 17 <= len; ) {
        if (!isMacAt(payload + i)) { i++; continue; }

        char mac[18];
        for (int k = 0; k < 17; k++) {
            char c = payload[i + k];
            mac[k] = (k % 3 == 2) ? ':' : toupper((unsigned char)c);
        }
        mac[17] = 0;
        i += 17;

        while (i < len && (payload[i] == ':' || payload[i] == '"' ||
                            payload[i] == ' ' || payload[i] == '=')) i++;
        size_t wstart = i;
        while (i < len && isalpha((unsigned char)payload[i])) i++;

        int idx = findRegistry(mac);
        if (idx >= 0) {
            registry[idx].priority = parsePriorityWord(payload + wstart, i - wstart);
            applied++;
        }
    }
    if (applied > 0)
        Serial.printf("[PRIORITY] จาก %s → ปรับ priority %d เรือน\n", src, applied);
    else
        Serial.printf("[PRIORITY] จาก %s ไม่พบ MAC ที่ตรงกับทะเบียนเลย\n", src);
    return applied > 0;
}

// โหลดรายชื่อตอนบูต: NVS ก่อน ถ้าไม่มีค่อยใช้ค่าสำรองใน firmware
static void loadRegistryAtBoot() {
    numRegistered = 0;
    prefs.begin("naid", true);
    String csv = prefs.getString("devices", "");
    prefs.end();

    if (csv.length() >= 17) {
        char tmp[MAX_REGISTERED][18];
        int n = extractMacs(csv.c_str(), tmp, MAX_REGISTERED);
        for (int i = 0; i < n; i++) addToRegistry(tmp[i]);
        Serial.printf("ทะเบียน: ใช้รายชื่อที่จำไว้ %d เรือน (รอ MQTT อัปเดต)\n", numRegistered);
    }
    if (numRegistered == 0) {
        for (int i = 0; i < NUM_FALLBACK; i++) addToRegistry(FALLBACK_DEVICES[i]);
        Serial.printf("ทะเบียน: ใช้ค่าสำรองใน firmware %d เรือน\n", numRegistered);
    }
}

// ═══════════════════════════════════════════════════════════════════
// OTA + สั่งงานระยะไกล
// ═══════════════════════════════════════════════════════════════════
// RTC memory อยู่รอดข้ามการรีเซ็ต (แต่หายเมื่อถอดไฟ) — ใช้นับว่ารีบูตเองกี่ครั้ง
RTC_NOINIT_ATTR static uint32_t rtcBootCount;
RTC_NOINIT_ATTR static uint32_t rtcMagic;
#define RTC_MAGIC_VALUE 0xA1D0001u

static const char* resetReasonText() {
    switch (esp_reset_reason()) {
        case ESP_RST_POWERON:  return "เสียบไฟใหม่";
        case ESP_RST_SW:       return "สั่งรีบูตจากโปรแกรม";
        case ESP_RST_PANIC:    return "โปรแกรมแครช (panic)";
        case ESP_RST_INT_WDT:  return "🔴 Interrupt watchdog (ISR ค้าง)";
        case ESP_RST_TASK_WDT: return "🔴 Task watchdog (loop ค้าง)";
        case ESP_RST_WDT:      return "🔴 watchdog อื่น";
        case ESP_RST_BROWNOUT: return "🔴 ไฟตก (brownout) — ตรวจอะแดปเตอร์/สายไฟ";
        case ESP_RST_EXT:      return "กดปุ่ม reset";
        case ESP_RST_DEEPSLEEP:return "ตื่นจาก deep sleep";
        default:               return "ไม่ทราบสาเหตุ";
    }
}

static bool otaReady = false;          // เริ่ม ArduinoOTA แล้วหรือยัง
static volatile bool otaBusy = false;      // ระหว่างอัปเดต หยุดงานอื่นทั้งหมด
static uint32_t pendingRebootAt = 0;
static String   activeMqttBroker;
static bool     brokerOnTrial         = false;  // กำลังทดลอง broker ตัวใหม่อยู่
static uint32_t brokerOkSince         = 0;      // ต่อ broker ทดลองติดมาตั้งแต่เมื่อไร
static bool     brokerRollbackPending = false;  // ต้องแจ้งกลับว่า rollback แล้ว
static bool     brokerTrialAnnounced  = false;  // แจ้ง broker_trial ไปแล้วหรือยัง (แจ้งครั้งเดียว)

static void nlog(const char* fmt, ...) {
    char b[200];
    va_list ap; va_start(ap, fmt);
    vsnprintf(b, sizeof(b), fmt, ap);
    va_end(ap);
    Serial.println(b);
    if (mqtt.connected()) {                // ส่งขึ้น MQTT ด้วย เพราะปกติไม่มีใครเสียบ USB เฝ้าดู
        char t[64];
        snprintf(t, sizeof(t), "%s/node/%s/log", MQTT_BASE_TOPIC, NODE_ID);
        mqtt.publish(t, b);
    }
}

static void publishOtaStatus(const char* state, const char* detail) {
    if (!mqtt.connected()) return;
    char t[64], p[256];
    snprintf(t, sizeof(t), "%s/node/%s/ota", MQTT_BASE_TOPIC, NODE_ID);
    snprintf(p, sizeof(p), "{\"state\":\"%s\",\"detail\":\"%s\",\"version\":\"%s\"}",
             state, detail, FW_VERSION);
    mqtt.publish(t, p);
    mqtt.loop();                           // ดันออกทันทีก่อนจะไปทำงานหนัก
}

static void slotCleanupFwd(DeviceSlot& s, bool graceful, bool planned = false);   // นิยามจริงอยู่ด้านล่าง

static void doHttpOta(const char* url) {
    nlog("[OTA] เริ่มอัปเดตจาก %s", url);
    publishOtaStatus("start", url);
    otaBusy = true;

    // ปลด BLE ทั้งหมดก่อน — คืน RAM และไม่ให้แย่งคลื่นระหว่างโหลดไฟล์
    NimBLEDevice::getScan()->stop();
    scanRunning = false;
    for (auto& s : slots) if (s.inUse) slotCleanupFwd(s, true);
    delay(300);

    WiFiClient client;
    httpUpdate.rebootOnUpdate(false);      // จะรีบูตเองหลังแจ้งผลแล้ว
    httpUpdate.setLedPin(-1);
    t_httpUpdate_return ret = httpUpdate.update(client, url);

    switch (ret) {
        case HTTP_UPDATE_OK:
            publishOtaStatus("success", "กำลังรีบูตเข้าเฟิร์มแวร์ใหม่");
            nlog("[OTA] ✅ สำเร็จ — รีบูต");
            delay(500);
            ESP.restart();
            break;
        case HTTP_UPDATE_NO_UPDATES:
            publishOtaStatus("no_update", "เซิร์ฟเวอร์ไม่มีไฟล์ใหม่");
            break;
        default: {
            char e[128];
            snprintf(e, sizeof(e), "code=%d %s", httpUpdate.getLastError(),
                     httpUpdate.getLastErrorString().c_str());
            publishOtaStatus("failed", e);
            nlog("[OTA] ❌ ล้มเหลว %s (เฟิร์มแวร์เดิมยังอยู่ครบ)", e);
            break;
        }
    }
    otaBusy = false;                       // ล้มเหลว → กลับไปทำงานปกติต่อ
}

// ตรวจว่าเป็น IPv4 ที่ใช้ได้จริง — กัน admin พิมพ์ผิดแล้วเครื่องหลุดจากระบบถาวร
static bool isUsableBrokerAddr(const String& s) {
    if (s.length() < 7 || s.length() >= 48) return false;
    if (s.indexOf(':') >= 0) return false;              // ปฏิเสธ IPv6 — โหนดใช้ IPv4 เท่านั้น
    int dots = 0;
    for (size_t i = 0; i < s.length(); i++) {
        char c = s[i];
        if (c == '.') dots++;
        else if (c < '0' || c > '9') return false;      // อนุญาตแค่ตัวเลขกับจุด
    }
    if (dots != 3) return false;
    IPAddress probe;
    if (!probe.fromString(s)) return false;
    if (probe[0] == 0) return false;                    // 0.x.x.x
    if (probe[0] == 127) return false;                  // loopback
    if (probe[0] == 255 || probe[3] == 255) return false; // broadcast
    return true;
}

