oatchidol/NurseAid/firmware/nurseaid_esp32.ino
// คำสั่งเป็นข้อความธรรมดา ส่งด้วย mosquitto_pub ได้ตรง ๆ ไม่ต้องมี GUI
static void handleCommand(const char* cmd) {
    nlog("[CMD] รับคำสั่ง: %s", cmd);

    if (strncmp(cmd, "name ", 5) == 0) {
        // ตั้งชื่อที่จำง่ายแทนชื่อจาก MAC เช่น  name ward-a-1
        //   ⚠️ ต้องไม่ซ้ำกับโหนดอื่น และห้ามมี / หรือเว้นวรรค (ใช้ใน MQTT topic)
        String nm = String(cmd + 5); nm.trim();
        if (nm.length() < 1 || nm.length() >= sizeof(NODE_ID)) {
            nlog("[CMD] ชื่อต้องยาว 1-%d ตัว", (int)sizeof(NODE_ID) - 1); return;
        }
        if (nm.indexOf('/') >= 0 || nm.indexOf(' ') >= 0 || nm.indexOf('+') >= 0
            || nm.indexOf('#') >= 0) {
            nlog("[CMD] ชื่อห้ามมี / เว้นวรรค + หรือ # (ใช้ใน MQTT topic)"); return;
        }
        prefs.begin("naid", false); prefs.putString("nodename", nm); prefs.end();
        nlog("[CMD] ตั้งชื่อเป็น '%s' — รีบูตเพื่อใช้งาน", nm.c_str());
        pendingRebootAt = millis() + 2000;

    } else if (strcmp(cmd, "name-reset") == 0) {
        prefs.begin("naid", false); prefs.remove("nodename"); prefs.end();
        nlog("[CMD] ล้างชื่อที่ตั้งไว้ — จะกลับไปใช้ชื่อจาก MAC หลังรีบูต");
        pendingRebootAt = millis() + 2000;

    } else if (strncmp(cmd, "wifi-add ", 9) == 0) {
        // เพิ่ม WiFi ชุดใหม่ "โดยไม่ลบของเดิม" — ใช้เตรียมไว้ก่อนวันเปลี่ยนเครือข่าย
        //   psk  : wifi-add psk  <ssid> <password>
        //   open : wifi-add open <ssid>
        //   peap : wifi-add peap <ssid> <username> <password>
        //   ttls : wifi-add ttls <ssid> <username> <password>
        //   ⚠️ ทุกฟิลด์ห้ามมีเว้นวรรค (ใช้เว้นวรรคเป็นตัวแยก)
        char a[5][80] = {{0}};
        int  na = 0;
        const char* q = cmd + 9;
        while (*q && na < 5) {
            while (*q == ' ') q++;
            if (!*q) break;
            const char* sp = strchr(q, ' ');
            size_t len = sp ? (size_t)(sp - q) : strlen(q);
            if (len >= sizeof(a[0])) len = sizeof(a[0]) - 1;
            memcpy(a[na], q, len); a[na][len] = 0; na++;
            q = sp ? sp + 1 : q + strlen(q);
        }
        if (na < 2) { nlog("[CMD] ใช้: wifi-add <psk|open|peap|ttls> <ssid> ..."); return; }

        WifiCred c;
        c.auth = authFromName(String(a[0]));
        c.ssid = a[1];
        if (c.auth == AUTH_PEAP || c.auth == AUTH_TTLS) {
            if (na < 4) { nlog("[CMD] enterprise ต้องมี <ssid> <username> <password>"); return; }
            c.username = a[2];
            c.identity = a[2];        // ส่วนใหญ่ identity = username
            c.pass     = a[3];
        } else if (c.auth == AUTH_PSK) {
            if (na < 3) { nlog("[CMD] psk ต้องมีรหัสผ่าน"); return; }
            c.pass = a[2];
        }
        wifiListAdd(c);
        nlog("[CMD] เพิ่ม '%s' (%s) แล้ว — จะใช้อัตโนมัติเมื่อชุดปัจจุบันใช้ไม่ได้",
             c.ssid.c_str(), AUTH_NAME[c.auth]);

    } else if (strcmp(cmd, "wifi-list") == 0) {
        wifiListPrint();

    } else if (strcmp(cmd, "wifi-reset") == 0) {
        // ล้างค่า WiFi ที่บันทึกไว้ → บูตหน้าถัดไปจะเปิดหน้าเว็บให้ตั้งใหม่
        // ⚠️ ใช้ตอนย้ายโหนดไปโรงพยาบาลอื่น หรือโรงพยาบาลเปลี่ยนรหัส WiFi
        //    หลังสั่งแล้วโหนดจะออฟไลน์ ต้องไปตั้งค่าที่หน้างานเท่านั้น
        nlog("[CMD] ล้างค่า WiFi แล้ว — รีบูตเข้าโหมดตั้งค่า");
        {
            WiFiManager wm;
            wm.resetSettings();
        }
        pendingRebootAt = millis() + 2000;

    } else if (strcmp(cmd, "reboot") == 0) {
        nlog("[CMD] จะรีบูตใน 2 วินาที");
        pendingRebootAt = millis() + 2000;

    } else if (strcmp(cmd, "status") == 0 || strcmp(cmd, "version") == 0) {
        int links = 0;
        for (auto& s : slots) if (s.inUse) links++;
        nlog("[CMD] เวอร์ชัน %s · เชื่อม %d/%d เรือน · heap %lu · IP %s",
             FW_VERSION, links, MAX_DEVICES,
             (unsigned long)ESP.getFreeHeap(), WiFi.localIP().toString().c_str());

    } else if (strncmp(cmd, "ota ", 4) == 0) {
        bool brokerArmed = false;
        const char* p = cmd + 4;
        while (*p == ' ') p++;
        // หาช่องว่างตัวถัดไป (คั่นระหว่าง url กับ broker_ip)
        const char* spacePtr = strchr(p, ' ');
        String url;
        String newBroker = "";
        
        if (spacePtr != nullptr) {
            url = String(p).substring(0, spacePtr - p);
            newBroker = String(spacePtr + 1);
            newBroker.trim();
        } else {
            url = String(p);
        }

        if (url.startsWith("http://") || url.startsWith("https://")) {
            if (newBroker.length() > 0) {
                if (!isUsableBrokerAddr(newBroker)) {
                    nlog("[OTA] ❌ broker IP ไม่ถูกต้อง: %s — ยกเลิกทั้งคำสั่ง", newBroker.c_str());
                    publishOtaStatus("failed", "broker ip ไม่ถูกต้อง");
                    return;
                }
                if (newBroker != activeMqttBroker) {
                    prefs.begin("naid", false);
                    // บอร์ดที่ไม่เคยย้าย broker ยังไม่มีคีย์นี้ใน NVS — ถ้าไม่ตรึงไว้ตอนนี้
                    // ตอนถอยกลับจะไปได้ค่า default ของเฟิร์มแวร์ใหม่ ซึ่งไม่เคยพิสูจน์ว่าต่อติด
                    if (prefs.getString("mqtt_broker", "").length() == 0)
                        prefs.putString("mqtt_broker", activeMqttBroker);
                    prefs.putString("mqtt_broker_try", newBroker);   // ไม่ทับตัวที่ยืนยันแล้ว
                    brokerArmed = true;
                    prefs.putUChar("mqtt_try_boots", 0);
                    prefs.end();
                    nlog("[OTA] ตั้ง broker ทดลอง %s (ตัวเดิมยังเก็บไว้เป็นทางถอย)", newBroker.c_str());
                }
            }
            doHttpOta(url.c_str());
            // มาถึงบรรทัดนี้ = doHttpOta ไม่ได้รีบูต → อัปเดตไม่สำเร็จ
            // ต้องปลด broker ทดลองออก ไม่ให้ไปโดนใช้ตอนรีบูตรอบหน้าโดยไม่ตั้งใจ
            if (brokerArmed) {
                prefs.begin("naid", false);
                prefs.remove("mqtt_broker_try");
                prefs.remove("mqtt_try_boots");
                prefs.end();
                nlog("[OTA] อัปเดตไม่สำเร็จ → ปลด broker ทดลองออกแล้ว");
            }
        } else {
            nlog("[CMD] URL ไม่ถูกต้อง ต้องขึ้นต้นด้วย http:// หรือ https://");
        }

    } else if (strncmp(cmd, "broker ", 7) == 0) {
        String nb = String(cmd + 7); nb.trim();
        if (!isUsableBrokerAddr(nb)) {
            nlog("[CMD] broker IP ไม่ถูกต้อง: %s", nb.c_str());
            publishOtaStatus("failed", "broker ip ไม่ถูกต้อง");
            return;
        }
        if (nb == activeMqttBroker) { nlog("[CMD] broker เดิมอยู่แล้ว ไม่ต้องเปลี่ยน"); return; }
        prefs.begin("naid", false);
        if (prefs.getString("mqtt_broker", "").length() == 0)
            prefs.putString("mqtt_broker", activeMqttBroker);
        prefs.putString("mqtt_broker_try", nb);
        prefs.putUChar("mqtt_try_boots", 0);
        prefs.end();
        nlog("[CMD] ตั้ง broker ทดลอง %s — รีบูตเพื่อทดลองใช้", nb.c_str());
        publishOtaStatus("broker_trial", nb.c_str());
        pendingRebootAt = millis() + 2000;

    } else {
        nlog("[CMD] ไม่รู้จักคำสั่ง | ใช้ได้: status, version, reboot, ota <url>, "
             "wifi-add <psk|open|peap|ttls> <ssid> ..., wifi-list, wifi-reset, "
             "name <ชื่อ>, name-reset");
    }
}

