oatchidol/NurseAid/firmware/nurseaid_esp32.ino
static void setupArduinoOTA() {
    static char host[32];
    snprintf(host, sizeof(host), "naid-%s", NODE_ID);
    ArduinoOTA.setHostname(host);
    ArduinoOTA.setPassword(OTA_PASSWORD);
    ArduinoOTA.onStart([]() {
        otaBusy = true;
        NimBLEDevice::getScan()->stop();
        scanRunning = false;
        for (auto& s : slots) if (s.inUse) slotCleanupFwd(s, true);
        Serial.println("[OTA] เริ่มรับเฟิร์มแวร์ (push)");
    });
    ArduinoOTA.onProgress([](unsigned int p, unsigned int t) {
        static int last = -1;
        int pct = t ? (int)(p * 100 / t) : 0;
        if (pct / 10 != last) { last = pct / 10; Serial.printf("[OTA] %d%%\n", pct); }
    });
    ArduinoOTA.onEnd([]()   { Serial.println("[OTA] ✅ สำเร็จ — รีบูต"); });
    ArduinoOTA.onError([](ota_error_t e) {
        Serial.printf("[OTA] ❌ error %u\n", e);
        otaBusy = false;
    });
    ArduinoOTA.begin();
    Serial.printf("[OTA] พร้อมรับ push ที่ %s.local (พอร์ต 3232)\n", host);
}

// ── รับข้อความจาก MQTT ──
static void mqttCallback(char* topic, byte* payload, unsigned int len) {
    // วินิจฉัย: พิมพ์ทุกข้อความที่เข้ามา ใช้แยกสาเหตุเวลาไม่ได้รับรายชื่อ
    //   ไม่มีบรรทัดนี้เลย   = ข้อความไม่ถึงเครื่อง (ไม่ได้ retain / ACL / คนละ broker)
    //   มีแต่ไม่ถูกใช้      = topic ไม่ตรงกับที่โค้ดรอ
    Serial.printf("[MQTT-RX] %s (%u ไบต์)\n", topic, len);
    if (len == 0 || len > 900) {
        Serial.println("[MQTT-RX] ⚠️ ขนาดไม่เข้าเกณฑ์ — ทิ้ง");
        return;
    }
    static char buf[901];
    memcpy(buf, payload, len);
    buf[len] = 0;

    // คำสั่งควบคุมมาก่อน
    if (strcmp(topic, TOPIC_CMD_NODE) == 0 || strcmp(topic, TOPIC_CMD_ALL) == 0) {
        handleCommand(buf);
        return;
    }

    // priority — คนละ topic กับรายชื่อ MAC เพราะเป็นข้อมูลคนละก้อนที่เปลี่ยนคนละจังหวะกัน
    if (strcmp(topic, TOPIC_PRIORITY_NODE) == 0 || strcmp(topic, TOPIC_PRIORITY_ALL) == 0) {
        applyPriorityList(buf, strcmp(topic, TOPIC_PRIORITY_NODE) == 0
                               ? "priority เฉพาะโหนด" : "priority รวม");
        return;
    }

    bool isNode = (strcmp(topic, TOPIC_DEVICES_NODE) == 0);
    bool isAll  = (strcmp(topic, TOPIC_DEVICES_ALL)  == 0);

    // รายชื่อเฉพาะโหนดสำคัญกว่ารายชื่อรวม — ถ้าได้ของเฉพาะแล้วก็ไม่ต้องสนของรวม
    if (isAll && haveNodeList) {
        Serial.println("[LIST] ข้ามรายชื่อรวม เพราะมีรายชื่อเฉพาะโหนดแล้ว");
        return;
    }
    if (!isNode && !isAll) {
        Serial.printf("[MQTT-RX] topic ไม่ตรงกับที่รออยู่ — ข้าม\n");
        return;
    }
    // ข้อความมาถึง topic รายชื่อ = broker นี้มีข้อมูลที่แอปเรา publish ไว้จริง
    // (ble/mac ส่งแบบ retained) ใช้เป็นหลักฐานว่าไม่ใช่ broker ตัวอื่นที่บังเอิญรับ
    // connection ได้ — ตั้งก่อน parse เพราะรายชื่อว่าง (DB ยังไม่จับคู่) ก็ยังนับ
    sawAppRoster = true;

    if (applyDeviceList(buf, isNode ? "รายชื่อเฉพาะโหนด" : "รายชื่อรวม") && isNode)
        haveNodeList = true;
}

// รายงานว่า "ตอนนี้โหนดนี้ถือรายชื่ออะไรอยู่จริง" — ส่งแบบ retained
//   มีไว้ให้ฝั่งเว็บ/ผู้ดูแลตรวจสอบได้ว่า DB กับ ESP32 ตรงกันไหม
//   สำคัญเมื่อไม่มีตัว sync คอยไล่ตรวจให้ ถ้าเว็บลืมส่ง MQTT จะเห็นความต่างตรงนี้
static void reportActiveList() {
    if (!listDirty || !mqtt.connected()) return;
    listDirty = false;

    char payload[MAX_REGISTERED * 18 + 8];
    int  pos = 0;
    for (int i = 0; i < numRegistered && pos < (int)sizeof(payload) - 20; i++) {
        pos += snprintf(payload + pos, sizeof(payload) - pos, "%s%s",
                        i ? "," : "", registry[i].macUp);
    }
    payload[pos] = 0;

    char topic[64];
    snprintf(topic, sizeof(topic), "%s/node/%s/devices", MQTT_BASE_TOPIC, NODE_ID);
    mqtt.publish(topic, payload, true);      // retained
    Serial.printf("[LIST] รายงานรายชื่อที่ใช้อยู่ %d เรือน → %s\n", numRegistered, topic);
}

// ═══════════════════════════════════════════════════════════════════
// จัดการรายชื่อ WiFi ที่จำไว้ (เก็บใน NVS namespace "naid" คีย์ wifi_list)
//   รูปแบบที่เก็บ: ssid1\tpass1\nssid2\tpass2\n...
//   ใช้ \t และ \n เป็นตัวคั่นเพราะ SSID/รหัสผ่านมี , และ ; ได้
// ═══════════════════════════════════════════════════════════════════
// รูปแบบที่เก็บใน NVS (1 บรรทัด = 1 เครือข่าย, คั่นฟิลด์ด้วย \t):
//    ssid \t auth \t pass \t identity \t username
//    auth: psk | open | peap | ttls
//  ใช้ \t เพราะ SSID และรหัสผ่านมี , ; : ได้ แต่มี tab ไม่ได้
// ═══════════════════════════════════════════════════════════════════
// ตั้งชื่อโหนด — ลำดับความสำคัญ: ชื่อที่ตั้งไว้เอง > ค่าใน firmware > จาก MAC
// ═══════════════════════════════════════════════════════════════════
// คืน 3 ไบต์ "ท้าย" ของ MAC เรียงตามที่พิมพ์บนตัวบอร์ด
//
//   ⚠️ ห้ามใช้ ESP.getEfuseMac() & 0xFFFFFF เด็ดขาด
//      ฟังก์ชันนั้นคืนค่าโดยสลับลำดับไบต์ การ & 0xFFFFFF จึงได้ 3 ไบต์ "แรก"
//      ซึ่งคือ OUI (รหัสผู้ผลิต) — เหมือนกันทุกบอร์ดที่ผลิตล็อตเดียวกัน → ชื่อชนกัน
//      ตัวอย่างจริง: MAC 7C:4F:AD:79:98:70 → ได้ 0xAD4F7C (คือ 7C:4F:AD กลับด้าน)
//
//   esp_read_mac() คืน byte array เรียงถูกต้องอยู่แล้ว จึงหยิบ mac[3..5] ตรง ๆ ได้
static uint32_t macSuffix24() {
    uint8_t mac[6] = {0};
    if (esp_read_mac(mac, ESP_MAC_WIFI_STA) != ESP_OK) return 0;
    return ((uint32_t)mac[3] << 16) | ((uint32_t)mac[4] << 8) | mac[5];
}

static void resolveNodeId() {
    prefs.begin("naid", true);
    String saved = prefs.getString("nodename", "");
    prefs.end();

    if (saved.length() > 0 && saved.length() < sizeof(NODE_ID)) {
        strncpy(NODE_ID, saved.c_str(), sizeof(NODE_ID) - 1);
        Serial.printf("ชื่อโหนด: %s (ตั้งไว้ผ่านคำสั่ง name)\n", NODE_ID);
    } else if (strlen(NODE_ID_FIXED) > 0) {
        strncpy(NODE_ID, NODE_ID_FIXED, sizeof(NODE_ID) - 1);
        Serial.printf("ชื่อโหนด: %s (กำหนดตายตัวใน firmware)\n", NODE_ID);
    } else {
        // 3 ไบต์ท้ายของ MAC — ส่วนที่ต่างกันจริงในแต่ละบอร์ด
        snprintf(NODE_ID, sizeof(NODE_ID), "n%06lx", (unsigned long)macSuffix24());
        Serial.printf("ชื่อโหนด: %s (ตั้งอัตโนมัติจาก MAC)\n", NODE_ID);
    }

    // topic ที่มีชื่อโหนดอยู่ข้างใน ต้องสร้างหลังรู้ชื่อแล้วเท่านั้น
    snprintf(TOPIC_CMD_NODE,     sizeof(TOPIC_CMD_NODE),     "%s/node/%s/cmd", MQTT_BASE_TOPIC, NODE_ID);
    snprintf(TOPIC_DEVICES_NODE, sizeof(TOPIC_DEVICES_NODE), "%s/mac/%s",      MQTT_BASE_TOPIC, NODE_ID);
    snprintf(TOPIC_PRIORITY_NODE, sizeof(TOPIC_PRIORITY_NODE), "%s/priority/%s", MQTT_BASE_TOPIC, NODE_ID);
}

static String wifiListLoad() {
    prefs.begin("naid", true);
    String v = prefs.getString("wifi_list", "");
    prefs.end();
    return v;
}
static void wifiListSave(const String& v) {
    prefs.begin("naid", false);
    prefs.putString("wifi_list", v);
    prefs.end();
}

