oatchidol/NurseAid/firmware/nurseaid_esp32.ino
static WifiAuth authFromName(const String& n) {
    for (uint8_t i = 0; i < 4; i++)
        if (n.equalsIgnoreCase(AUTH_NAME[i])) return (WifiAuth)i;
    return AUTH_PSK;
}

// แยก 1 บรรทัดเป็น WifiCred — คืน false ถ้ารูปแบบไม่ถูก
static bool parseCredLine(const String& line, WifiCred& c) {
    int f[4], n = 0, from = 0;
    while (n < 4) {
        int t = line.indexOf('\t', from);
        if (t < 0) break;
        f[n++] = t; from = t + 1;
    }
    if (n < 1) return false;                       // อย่างน้อยต้องมี ssid+auth
    c.ssid = line.substring(0, f[0]);
    if (c.ssid.length() == 0) return false;
    c.auth     = authFromName(n >= 2 ? line.substring(f[0]+1, f[1]) : line.substring(f[0]+1));
    c.pass     = (n >= 3) ? line.substring(f[1]+1, f[2]) : "";
    c.identity = (n >= 4) ? line.substring(f[2]+1, f[3]) : "";
    c.username = (n >= 4) ? line.substring(f[3]+1)       : "";
    return true;
}

static String credToLine(const WifiCred& c) {
    return c.ssid + "\t" + AUTH_NAME[c.auth] + "\t" + c.pass + "\t"
         + c.identity + "\t" + c.username + "\n";
}

// เพิ่มชุดใหม่ไว้บนสุด (SSID ซ้ำ = ทับของเดิม)
static bool wifiListAdd(const WifiCred& c) {
    if (c.ssid.length() == 0) return false;
    String list = wifiListLoad(), out = credToLine(c);
    int kept = 1, start = 0;
    while (start < (int)list.length() && kept < WIFI_MAX_SAVED) {
        int nl = list.indexOf('\n', start);
        if (nl < 0) break;
        String line = list.substring(start, nl);
        start = nl + 1;
        WifiCred old;
        if (!parseCredLine(line, old)) continue;
        if (old.ssid == c.ssid) continue;          // ทับของเดิม
        out += line + "\n";
        kept++;
    }
    wifiListSave(out);
    Serial.printf("[WIFI-LIST] เพิ่ม '%s' (%s) — จำไว้ %d ชุด\n",
                  c.ssid.c_str(), AUTH_NAME[c.auth], kept);
    return true;
}

// เชื่อมต่อ 1 ชุด รองรับทุกแบบ — คืน true ถ้าติด
static bool wifiTryConnect(const WifiCred& c) {
    Serial.printf("[WiFi] ลอง '%s' (%s) ... ", c.ssid.c_str(), AUTH_NAME[c.auth]);
    WiFi.disconnect(true, false);
    delay(150);

    if (c.auth == AUTH_PEAP || c.auth == AUTH_TTLS) {
        // ⚠️ Enterprise ต้องตั้งค่า "ก่อน" WiFi.begin() และห้ามส่งรหัสใน begin()
        String id = c.identity.length() ? c.identity : c.username;
        esp_wifi_sta_wpa2_ent_set_identity((uint8_t*)id.c_str(), id.length());
        esp_wifi_sta_wpa2_ent_set_username((uint8_t*)c.username.c_str(), c.username.length());
        esp_wifi_sta_wpa2_ent_set_password((uint8_t*)c.pass.c_str(), c.pass.length());
        if (c.auth == AUTH_TTLS)
            esp_wifi_sta_wpa2_ent_set_ttls_phase2_method(ESP_EAP_TTLS_PHASE2_MSCHAPV2);
        esp_wifi_sta_wpa2_ent_enable();
        WiFi.begin(c.ssid.c_str());
    } else {
        // ปิด Enterprise เผื่อชุดก่อนหน้าเปิดค้างไว้ ไม่งั้น PSK จะเชื่อมไม่ติด
        esp_wifi_sta_wpa2_ent_disable();
        if (c.auth == AUTH_OPEN) WiFi.begin(c.ssid.c_str());
        else                     WiFi.begin(c.ssid.c_str(), c.pass.c_str());
    }

    uint32_t t0 = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - t0 < WIFI_TRY_TIMEOUT_MS) {
        delay(250);
        esp_task_wdt_reset();
    }
    bool ok = (WiFi.status() == WL_CONNECTED);
    Serial.println(ok ? "✅" : "❌");
    return ok;
}

// ไล่ลองทุกชุดที่จำไว้ตามลำดับ
static bool wifiConnectFromList() {
    String list = wifiListLoad();
    int start = 0, n = 0;
    while (start < (int)list.length()) {
        int nl = list.indexOf('\n', start);
        if (nl < 0) break;
        String line = list.substring(start, nl);
        start = nl + 1;
        WifiCred c;
        if (!parseCredLine(line, c)) continue;
        n++;
        if (wifiTryConnect(c)) return true;
    }
    if (n == 0) Serial.println("[WiFi] ยังไม่มีชุดที่จำไว้");
    return false;
}

static void wifiListPrint() {
    String list = wifiListLoad();
    int start = 0, n = 0; String out;
    while (start < (int)list.length()) {
        int nl = list.indexOf('\n', start);
        if (nl < 0) break;
        WifiCred c;
        if (parseCredLine(list.substring(start, nl), c))
            out += String(++n) + "." + c.ssid + "(" + AUTH_NAME[c.auth] + ") ";
        start = nl + 1;
    }
    nlog("[WIFI-LIST] จำไว้ %d ชุด: %s", n, n ? out.c_str() : "(ว่าง)");
}

static void subscribeDeviceList() {
    // เช็คผลจริง — subscribe ล้มเหลวได้เงียบ ๆ เช่นโดน ACL ปฏิเสธ
    bool okNode = mqtt.subscribe(TOPIC_DEVICES_NODE);
    bool okAll  = mqtt.subscribe(TOPIC_DEVICES_ALL);
    Serial.printf("[MQTT] subscribe %s → %s\n", TOPIC_DEVICES_NODE, okNode ? "✅" : "❌");
    Serial.printf("[MQTT] subscribe %s → %s\n", TOPIC_DEVICES_ALL,  okAll  ? "✅" : "❌");
    mqtt.subscribe(TOPIC_CMD_NODE);        // รับคำสั่งเฉพาะโหนดนี้
    mqtt.subscribe(TOPIC_CMD_ALL);         // รับคำสั่งที่ยิงถึงทุกโหนด
    Serial.printf("[MQTT] รับคำสั่งที่ %s และ %s\n", TOPIC_CMD_NODE, TOPIC_CMD_ALL);
    mqtt.subscribe(TOPIC_PRIORITY_NODE);
    mqtt.subscribe(TOPIC_PRIORITY_ALL);
    Serial.printf("[MQTT] รอ priority จาก %s และ %s\n", TOPIC_PRIORITY_NODE, TOPIC_PRIORITY_ALL);
    Serial.printf("[MQTT] รอรายชื่อจาก %s และ %s\n", TOPIC_DEVICES_NODE, TOPIC_DEVICES_ALL);
}


//   {"value": X, "mac": "AA:BB:..", "time": "...", "uuid": "..."}
// ═══════════════════════════════════════════════════════════════════
static void publishMetric(DeviceSlot& s, PubKey key, float value, bool isFloat) {
    uint32_t now = millis();
    if (now - s.lastPub[key] < MQTT_PUBLISH_INTERVAL_MS) return;   // rate limit
    s.lastPub[key] = now;
    if (!mqtt.connected()) return;

    char ts[24];  timeStr(ts, sizeof(ts));
    char uid[40]; makeUuid(uid);
    char val[16];
    if (isFloat) snprintf(val, sizeof(val), "%.1f", value);
    else         snprintf(val, sizeof(val), "%d", (int)value);

    char topic[48];
    snprintf(topic, sizeof(topic), "%s/%s", MQTT_BASE_TOPIC, PUB_KEY_NAME[key]);
    char payload[160];
    snprintf(payload, sizeof(payload),
             "{\"value\": %s, \"mac\": \"%s\", \"time\": \"%s\", \"uuid\": \"%s\"}",
             val, s.macUp, ts, uid);
    mqtt.publish(topic, payload);
}

// ── ส่งชุด "สวมอยู่" (ตรรกะเดียวกับ _publish_wearing) ──
static void publishWearing(DeviceSlot& s, int heart, float temp) {
    publishMetric(s, K_TEMP, temp, true);
    publishMetric(s, K_STATUS, 1, false);

