oatchidol/NurseAid/firmware/nurseaid_esp32.ino
    // HR Freeze — งดส่ง HR=0 ชั่วคราวหลังวัด SpO2 (กันกราฟตกหลอกๆ)
    bool freeze = (heart == 0) &&
                  (millis() - s.lastSpo2End <= HR_FREEZE_AFTER_SPO2_MS) &&
                  (s.lastSpo2End != 0);
    if (!freeze) publishMetric(s, K_HEART, heart, false);

    // ส่ง SpO2 ล่าสุดซ้ำทุกรอบ ให้ dashboard เห็นค่าต่อเนื่อง
    if (s.lastSpo2 > 0) publishMetric(s, K_SPO2, s.lastSpo2, false);
}

// ── ส่งชุด "ถอดแล้ว" (ตรรกะเดียวกับ _publish_off_wrist) ──
static void publishOffWrist(DeviceSlot& s) {
    s.lastSpo2 = 0;
    publishMetric(s, K_STATUS, 0, false);
    publishMetric(s, K_HEART, 0, false);
    publishMetric(s, K_TEMP, 0, false);
    publishMetric(s, K_SPO2, 0, false);
}

// ═══════════════════════════════════════════════════════════════════
// PARSER — ตรรกะเดียวกับ _parse_data / _detect_off_wrist ของ Python
//   ทำงานใน loop() (ดึงจากคิว) ไม่ใช่ใน BLE callback
// ═══════════════════════════════════════════════════════════════════
static void processFrame(DeviceSlot& s, const uint8_t* d, uint8_t len) {
    uint32_t nowF = millis();
    // วัดพฤติกรรมนาฬิการะหว่าง Phase 2 — ใช้ตอบว่า "เงียบจริงไหม" ในบันทึก
    if (s.phase >= PH_P2_STOPPING) {
        s.p2Frames++;
        if (s.p2LastFrame) {
            uint32_t gap = nowF - s.p2LastFrame;
            if (gap > s.p2Silence) s.p2Silence = gap;
        }
        s.p2LastFrame = nowF;
    }
    s.lastData = nowF;

    // 🟢 0x09 — HR & Temp (frame 25 ไบต์: byte21=HR, byte22-23 LE ÷10 = Temp)
    if (len >= 25 && d[0] == 0x09) {
        int   heart = d[21];
        float temp  = ((d[23] << 8) | d[22]) / 10.0f;
        if (temp < TEMP_VALID_MIN) return;                  // ค่าเพี้ยน ทิ้ง

        // ── ① ติดตามว่า HR "ค้าง" หรือไม่ ──
        //    ตอนสวมอยู่ ค่า HR จาก PPG จะแกว่งเสมอ (±1-3 bpm)
        //    การได้ค่าเดิมเป๊ะ ๆ ติดกันหลายครั้ง = sensor ไม่ได้อ่านของจริงแล้ว
        if (heart == s.lastHeart) { if (s.hrSameCount < 65535) s.hrSameCount++; }
        else {
            s.hrSameCount = 0;
            s.lastHeart = heart;
            // จดเวลาที่ค่าเปลี่ยน เฉพาะค่าที่อยู่ในช่วงชีพจรของคนจริง
            // (กันสัญญาณรบกวนที่กระโดดไปมานอกช่วงมานับเป็น "มีชีวิต")
            if (heart >= HR_PLAUSIBLE_MIN && heart <= HR_PLAUSIBLE_MAX) {
                s.hrChangeAt[s.hrChangeSeq % HR_CHANGES_FOR_ONWRIST] = millis();
                s.hrChangeSeq++;
            }
        }

        // ── ② สถานะ "สวมอยู่" กับ "ถอดแล้ว" ใช้เกณฑ์คนละชุด (hysteresis) ──
        //    ขาถอด  : ดูว่าอุณหภูมิ "ลดลงจากค่าฐาน" เท่าไหร่
        //    ขาสวมกลับ: ดูว่าอุณหภูมิ "สูงขึ้นจากจุดต่ำสุด" เท่าไหร่ + ถึงระดับผิวจริง
        //    แยกกันแบบนี้เพื่อไม่ให้สายรัดที่วางทิ้งไว้จนเย็นเท่าห้อง
        //    ถูกเข้าใจผิดว่าสวมกลับ (ค่าฐานจะไล่มาบรรจบกันเมื่ออุณหภูมิหยุดลด)

        // ตัวจับเวลา HR=0 (ยังเก็บไว้เผื่อนาฬิการุ่นที่ส่ง 0 จริง)
        if (heart > 0)            s.hrZeroStart = 0;
        else if (!s.inSpo2 && s.hrZeroStart == 0) s.hrZeroStart = millis();
        bool hrZeroLong = (s.hrZeroStart != 0) && !s.inSpo2 &&
                          (millis() - s.hrZeroStart > HR_ZERO_OFFWRIST_MS);
        bool hrFrozen = (s.hrSameCount >= HR_FROZEN_SAMPLES);
        bool wasWearing = s.isWearing;
        float tempDrop = 0.0f;

        if (s.isWearing) {
            // ─── กำลังสวมอยู่ → เฝ้าดูว่าถอดหรือยัง ───
            // ค่าฐาน: ขาขึ้นตามทันที ขาลงไล่ตามช้า
            if (!s.tempBaseInit)            { s.tempBaseline = temp; s.tempBaseInit = true; }
            else if (temp > s.tempBaseline)   s.tempBaseline = temp;
            else s.tempBaseline += (temp - s.tempBaseline) * TEMP_BASELINE_FALL_ALPHA;

            tempDrop = s.tempBaseline - temp;

            // ระหว่างวัด SpO2 นาฬิกาหยุดสตรีม HR เป็นปกติ — ห้ามตัดสินว่าถอดช่วงนั้น
            bool detectedOff = false;
            if (!s.inSpo2) {
                detectedOff =
                    (hrFrozen && tempDrop >= TEMP_DROP_WITH_HR) ||
                    (tempDrop >= TEMP_DROP_ALONE)               ||
                    (temp < TEMP_OFFWRIST_DEFINITE)             ||
                    (temp < TEMP_OFFWRIST_SUSPECT && hrZeroLong);
            }
            if (detectedOff) { if (s.offWristCount < 255) s.offWristCount++; }
            else               s.offWristCount = 0;

            if (s.offWristCount >= OFFWRIST_DEBOUNCE_COUNT) {
                s.isWearing = false;
                s.onWristCount = 0;
                s.tempFloor = temp;                 // เริ่มจับจุดต่ำสุดจากตรงนี้
                s.tempFloorInit = true;
                s.hrChangeSeq = 0;                  // เริ่มนับ HR มีชีวิตใหม่หมด
                s.offWristSince = millis();
            }
        } else {
            // ─── ถอดแล้ว → ต้องมีหลักฐานว่าสวมกลับจริงเท่านั้น ───
            // ค่าฐานถูกแช่ไว้ ไม่ให้ไล่ตามลงมาจนส่วนต่างหาย
            // ⚠️ ต้องใช้ธงกำกับ ห้ามเทียบกับค่า 0 ที่ยังไม่ได้ตั้ง
            //    ถ้า reconnect มาในสถานะถอด tempFloor ยังเป็น 0
            //    จะทำให้ (temp - 0) มากกว่าเกณฑ์เสมอ → เข้าใจผิดว่าสวมกลับทันที
            if (!s.tempFloorInit) { s.tempFloor = temp; s.tempFloorInit = true; }
            else if (temp < s.tempFloor) s.tempFloor = temp;

            bool rising    = (temp - s.tempFloor) >= TEMP_RISE_BACK;  // อุ่นขึ้นจากจุดต่ำสุด
            bool plausible = (temp >= TEMP_WEAR_MIN);                 // ถึงระดับสัมผัสผิวจริง

            // ── ชีพจรต้อง "มีชีวิต" ด้วย ──
            //    ครบจำนวนครั้งที่ต้องการ และครั้งที่เก่าสุดในกลุ่มต้องยังไม่เกินหน้าต่างเวลา
            //    = ค่าเปลี่ยนถี่พอในช่วงที่ผ่านมา ไม่ใช่เปลี่ยนนาน ๆ ครั้งจากสัญญาณรบกวน
            bool hrLive = false;
            if (s.hrChangeSeq >= HR_CHANGES_FOR_ONWRIST) {
                uint32_t oldest = s.hrChangeAt[s.hrChangeSeq % HR_CHANGES_FOR_ONWRIST];
                hrLive = (millis() - oldest) <= HR_LIVE_WINDOW_MS;
            }

            if (rising && plausible && hrLive) { if (s.onWristCount < 255) s.onWristCount++; }
            else                                 s.onWristCount = 0;

