oatchidol/NurseAid/firmware/nurseaid_esp32.ino
            if (s.onWristCount >= ONWRIST_DEBOUNCE_COUNT) {
                s.isWearing = true;
                s.offWristCount = 0;
                s.offWristSince = 0;
                s.tempBaseInit = false;             // ตั้งค่าฐานใหม่จากอุณหภูมิปัจจุบัน
                s.tempFloorInit = false;
                s.hrSameCount  = 0;
            }
        }

        if (wasWearing && !s.isWearing) {
            Serial.printf("[OFF-WRIST] %s ถอดแล้ว (HR ค้าง %u ครั้ง · temp ลด %.2f°C)\n",
                          s.macUp, s.hrSameCount, tempDrop);
        } else if (!wasWearing && s.isWearing) {
            Serial.printf("[ON-WRIST] %s สวมกลับแล้ว (temp %.2f°C ขึ้นจากต่ำสุด %.2f°C · HR เปลี่ยน %lu ครั้ง)\n",
                          s.macUp, temp, temp - s.tempFloor, (unsigned long)s.hrChangeSeq);
        }

        if (s.isWearing) publishWearing(s, heart, temp);
        else             publishOffWrist(s);
    }
    // 🔴 0x28 — SpO2 (byte3 = ค่า)
    else if (len >= 10 && d[0] == 0x28 && d[1] == 0x03) {
        uint8_t spo2 = d[3];
        if (spo2 > 0 && spo2 <= 100) {
            if (s.isWearing) {
                s.lastSpo2 = spo2;
                publishMetric(s, K_SPO2, spo2, false);
            }
            s.spo2Ready = true;
        }
    }
    // 🔋 0x13 — Battery
    else if (len >= 2 && d[0] == 0x13) {
        uint8_t batt = d[1];
        if (batt <= 100) publishMetric(s, K_BATT, batt, false);
    }
}

// ═══════════════════════════════════════════════════════════════════
// BLE CALLBACKS — ทำน้อยที่สุด แค่บันทึก/ส่งคิว/ตั้งธง
// ═══════════════════════════════════════════════════════════════════

// scan เจอ advertisement → อัพเดตทะเบียน (เทียบ MAC ตัวพิมพ์เล็ก)
class ScanCB : public NimBLEScanCallbacks {
    void onResult(const NimBLEAdvertisedDevice* adv) override {
        std::string a = adv->getAddress().toString();
        for (int i = 0; i < numRegistered; i++) {
            if (a == registry[i].macLow) {
                registry[i].lastSeen = millis();
                registry[i].rssi = adv->getRSSI();
                registry[i].addr = adv->getAddress();
                break;
            }
        }
    }
} scanCB;

class ClientCB : public NimBLEClientCallbacks {
    void onDisconnect(NimBLEClient* c, int reason) override {
        for (auto& s : slots) {
            if (s.inUse && s.client == c) {
                s.gone = true;                       // เก็บกวาดจริงใน loop()
                Serial.printf("[BLE] %s หลุด (reason=%d)\n", s.macUp, reason);
                break;
            }
        }
    }
} clientCB;

// notify จากนาฬิกา → หา slot จาก client แล้วโยนเข้าคิว
static void onNotify(NimBLERemoteCharacteristic* chr, uint8_t* data, size_t len, bool) {
    // ⚠️ ต้องตรวจ null ทุกชั้น — callback นี้ทำงานบน task ของ NimBLE
    //    ถ้า loop() เพิ่งเรียก deleteClient() ไปพอดี ตัว service/characteristic
    //    จะถูกทำลายไปแล้ว → getRemoteService() คืน NULL → เรียกต่อจะแครชทันที
    //    (ESP32-C3 มีคอร์เดียว จังหวะชนกันบ่อยกว่า WROOM ที่มี 2 คอร์มาก)
    if (!chr || !data || len == 0) return;
    const NimBLERemoteService* svc = chr->getRemoteService();
    if (!svc) return;
    NimBLEClient* c = svc->getClient();
    if (!c) return;
    for (uint8_t i = 0; i < MAX_DEVICES; i++) {
        if (slots[i].inUse && slots[i].client == c) {
            BleFrame f;
            f.slot = i;
            f.len = len > sizeof(f.data) ? sizeof(f.data) : (uint8_t)len;
            memcpy(f.data, data, f.len);
            xQueueSend(frameQueue, &f, 0);           // เต็มก็ทิ้ง (frame ถัดไปมาแทน)
            break;
        }
    }
}

// ═══════════════════════════════════════════════════════════════════
// SCAN MANAGEMENT — เปิดเฉพาะตอนมีช่องว่าง (slot เต็ม = ปิด ลดแย่ง radio)
// ═══════════════════════════════════════════════════════════════════
static int freeSlotCount() {
    int n = 0;
    for (auto& s : slots) if (!s.inUse) n++;
    return n;
}

static void manageScan() {
    bool want = freeSlotCount() > 0;
    if (want && !scanRunning) {
        NimBLEDevice::getScan()->start(0, false, true);   // 0 = ไม่จำกัดเวลา
        scanRunning = true;
        Serial.println("[SCAN] เริ่มค้นหา");
    } else if (!want && scanRunning) {
        NimBLEDevice::getScan()->stop();
        scanRunning = false;
        Serial.println("[SCAN] ครบทุกช่อง — หยุดค้นหา ลดการแย่ง radio");
    }
}

// ═══════════════════════════════════════════════════════════════════
// CONNECTOR — ต่อทีละเรือน มี stagger + backoff (แทน adapter lock ของ Python)
// ═══════════════════════════════════════════════════════════════════
static void slotCleanup(DeviceSlot& s, bool countAsFail, bool planned = false);

// กวาดเรือนที่หลุดออกทันที — เรียกแทรกได้ทุกจุดที่เพิ่งกลับจากงานที่ block นาน
//   ปกติ s.gone ถูกจัดการใน serviceSlot() แต่ถ้า loop ติดอยู่ใน connect()
//   Dashboard จะช้าตามไปด้วยทั้งโหนด จึงต้องกวาดแทรกตรงนี้เพิ่ม
static void sweepGoneSlots() {
    for (auto& s : slots) {
        if (s.inUse && s.gone) {
            Serial.printf("[SWEEP] %s หลุด — ส่งค่า 0 ทันที ไม่รอรอบ loop\n", s.macUp);
            slotCleanup(s, false);
        }
    }
}

static void tryConnectNext() {
    uint32_t now = millis();
    if (now - lastConnectAttempt < CONNECT_STAGGER_MS) return;

    // หา slot ว่าง
    int si = -1;
    for (int i = 0; i < MAX_DEVICES; i++) if (!slots[i].inUse) { si = i; break; }
    if (si < 0) return;

    // เลือกเรือนที่: เห็นล่าสุด ≤30 วิ, สัญญาณ ≥ -85, ไม่ได้อยู่ใน slot, พ้น cooldown
    int best = -1;
    for (int i = 0; i < numRegistered; i++) {
        RegDevice& r = registry[i];
        if (r.inSlot) continue;
        if (now < r.nextAttempt) continue;
        if (r.lastSeen == 0 || now - r.lastSeen > STALE_DEVICE_MS) continue;
        if (r.rssi < RSSI_MIN_THRESHOLD) continue;
        if (best < 0 || r.rssi > registry[best].rssi) best = i;   // เอาตัวสัญญาณดีสุดก่อน
    }
    if (best < 0) return;

    lastConnectAttempt = now;
    RegDevice& r = registry[best];

    // หยุด scan ระหว่าง connect — GATT discovery จะนิ่งกว่า
    // (บทเรียนเดียวกับที่โค้ดพี่ทำบน Pi)
    if (scanRunning) { NimBLEDevice::getScan()->stop(); scanRunning = false; }

    Serial.printf("[CONNECT] %s (RSSI %d) ...\n", r.macUp, r.rssi);

    DeviceSlot& s = slots[si];
    s = DeviceSlot();                                 // ล้างค่าเริ่มต้นทั้งหมด
    s.client = NimBLEDevice::createClient();
    if (!s.client) {
        // 🔴 ต้นเหตุ Guru Meditation: createClient() คืน nullptr เมื่อถึงเพดานของ NimBLE
        //    (ไลบรารีจำกัดที่ CONFIG_BT_NIMBLE_MAX_CONNECTIONS ซึ่ง default = 3)
        //    ถ้าไม่ตรวจตรงนี้ บรรทัดถัดไปจะอ่านที่ offset ของ NULL แล้วแครชทันที
        Serial.printf("[CONNECT] ❌ %s สร้าง client ไม่ได้ — ถึงเพดาน NimBLE แล้ว "
                      "(ต่ออยู่ %d เรือน) ดูวิธีแก้ที่หมายเหตุ MAX_DEVICES\n",
                      r.macUp, MAX_DEVICES - freeSlotCount());
        s = DeviceSlot();
        r.nextAttempt = now + 30000;      // พักยาวหน่อย ไม่ต้องรีบลองซ้ำ
        return;
    }
    s.client->setClientCallbacks(&clientCB, false);
    s.client->setConnectTimeout(BLE_CONNECT_TIMEOUT_MS);

    // ⚠️ connect() เป็น blocking (สูงสุด 15 วิ) — เรือนอื่นที่ต่ออยู่ไม่กระทบ
    //    (notify เข้าคิวต่อเนื่อง) แต่ MQTT จะเว้นช่วงสั้นๆ ซึ่ง keepalive 30 วิ รับได้
    if (!s.client->connect(r.addr)) {                 // exchangeMTU=true อัตโนมัติ
        // เพิ่งกลับจากการ block นานถึง 8 วิ — ระหว่างนั้นอาจมีเรือนอื่นหลุดไปแล้ว
        // กวาดทันทีก่อนทำอย่างอื่น เพื่อให้ Dashboard ไม่ค้างแสดงเรือนที่หลุดไปแล้ว
        sweepGoneSlots();
        Serial.printf("[CONNECT] %s ล้มเหลว\n", r.macUp);
        NimBLEDevice::deleteClient(s.client);
        s.client = nullptr;
        r.failCount++;
        if (r.failCount >= FAIL_COUNT_FOR_COOLDOWN) {
            Serial.printf("[COOLDOWN] %s fail ครบ %d ครั้ง พัก %d วิ\n",
                          r.macUp, r.failCount, COOLDOWN_MS / 1000);
            r.nextAttempt = now + COOLDOWN_MS;
            r.failCount = 0;
        } else {
            r.nextAttempt = now + 2000UL * r.failCount;   // backoff 2,4,6,8 วิ
        }
        return;
    }

    // ต่อติด → หา service/characteristic แล้ว subscribe
    // (ขั้น service discovery ก็ block เช่นกัน จึงกวาดเรือนที่หลุดอีกรอบ)
    sweepGoneSlots();
    NimBLERemoteService* svc = s.client->getService(UUID_SERVICE);
    NimBLERemoteCharacteristic* rx = svc ? svc->getCharacteristic(UUID_RX) : nullptr;
    s.txChar = svc ? svc->getCharacteristic(UUID_TX) : nullptr;
    if (!rx || !s.txChar || !rx->subscribe(true, onNotify)) {
        Serial.printf("[CONNECT] %s ไม่พบ FFF6/FFF7 หรือ subscribe ไม่ได้\n", r.macUp);
        s.client->disconnect();
        NimBLEDevice::deleteClient(s.client);
        s = DeviceSlot();
        r.failCount++;
        r.nextAttempt = now + 5000;
        return;
    }

    s.inUse = true;
    s.regIdx = best;
    // กู้สถานะจากครั้งก่อน — ถ้าเดิมถอดอยู่ ต้องยังถือว่าถอด
    // ไม่งั้นทุกครั้งที่ต่อกลับ Dashboard จะเห็น temp เด้งขึ้นมาชั่วครู่
    if (r.lastOffWrist) {
        s.isWearing     = false;
        s.offWristSince = millis();
        s.tempFloor     = 0.0f;
        s.tempFloorInit = false;
        s.hrChangeSeq   = 0;
        Serial.printf("[STATE] %s ต่อกลับแล้ว แต่ครั้งก่อนยังถอดอยู่ — คงสถานะถอดไว้\n", r.macUp);
    }
    strncpy(s.macUp, r.macUp, sizeof(s.macUp));
    s.phase = PH_SETUP;
    s.phaseAt = millis();
    s.lastData = millis();
    r.inSlot = true;
    r.failCount = 0;
    Serial.printf("[CONNECT] ✅ %s (MTU=%d) — รอ notify พร้อม\n",
                  s.macUp, s.client ? s.client->getMTU() : 0);
}

// ═══════════════════════════════════════════════════════════════════
// SLOT FSM — แทน _keep_receiving ของ Python (Phase1 ↔ Phase2 ไม่ block)
// ═══════════════════════════════════════════════════════════════════
// ส่งค่า 0 ทุกตัวเมื่อเรือนหลุด/ถูกตัด เพื่อให้ dashboard รู้ทันทีว่าไม่มีข้อมูลแล้ว
//   ต้องล้าง lastPub ก่อน ไม่งั้นจะติด rate limit 1 วิ แล้วค่าไม่ถูกส่งออกไปเลย
//   (จังหวะที่หลุดมักอยู่ห่างจากการส่งครั้งก่อนไม่ถึง 1 วินาที)
static void publishDisconnected(DeviceSlot& s, const char* reason) {
    if (!mqtt.connected() || !s.inUse) return;
    for (int k = 0; k < K_COUNT; k++) s.lastPub[k] = 0;   // บังคับให้ส่งได้แน่นอน
    s.lastSpo2 = 0;
    publishMetric(s, K_STATUS, 0, false);
    publishMetric(s, K_HEART,  0, false);
    publishMetric(s, K_SPO2,   0, false);
    publishMetric(s, K_TEMP,   0, false);
    mqtt.loop();                                          // ดันออกทันที ก่อนจะตัด BLE
    Serial.printf("[MQTT] %s ส่งค่า 0 ทั้งหมด (สาเหตุ: %s)\n", s.macUp, reason);
}

// พักตามรอบ priority — ต่างจาก publishDisconnected() ตรงที่ "ไม่" ล้างค่าชีพจรเป็น 0
// เพราะเรือนยังจับคู่อยู่ ค่าล่าสุดที่วัดได้ยังใช้ได้ ให้ฝั่งแอปถือค่าเดิมไว้จนถึงรอบหน้า
static void publishResting(DeviceSlot& s) {
    if (!mqtt.connected() || !s.inUse) return;
    for (int k = 0; k < K_COUNT; k++) s.lastPub[k] = 0;   // กัน rate limit 1 วิ เหมือนกัน
    publishMetric(s, K_STATUS, WEARABLE_STATUS_RESTING, false);
    mqtt.loop();
    Serial.printf("[MQTT] %s ส่งสถานะพักตามรอบ (status=%d)\n", s.macUp, WEARABLE_STATUS_RESTING);
}

static void slotCleanup(DeviceSlot& s, bool graceful, bool planned);
static void slotCleanupFwd(DeviceSlot& s, bool graceful, bool planned) { slotCleanup(s, graceful, planned); }

