oatchidol/NurseAid/firmware/nurseaid_esp32.ino
static void slotCleanup(DeviceSlot& s, bool graceful, bool planned) {
    // ส่งค่า 0 ก่อนเป็นอันดับแรก — ทำผ่าน WiFi เร็วกว่ารอ BLE disconnect
    if (planned) publishResting(s);
    else         publishDisconnected(s, graceful ? "ตัดการเชื่อมต่อ" : "อุปกรณ์หลุด");

    if (s.client) {
        if (graceful && s.client->isConnected()) {
            writeCmd(s, {0x09, 0x00, 0x00, 0x00});    // สั่งหยุดก่อนจาก (เหมือน finally ของ Python)
            writeCmd(s, {0x28, 0x03, 0x00});
            s.client->disconnect();
        }
        NimBLEDevice::deleteClient(s.client);
    }
    if (s.regIdx >= 0) {
        registry[s.regIdx].inSlot = false;
        registry[s.regIdx].lastOffWrist = !s.isWearing;   // จำไว้ใช้ตอนต่อกลับ
        registry[s.regIdx].nextAttempt = millis() + 3000;   // เว้นก่อนต่อใหม่
    }
    Serial.printf("[SLOT] %s ปิดช่องแล้ว\n", s.macUp);
    s = DeviceSlot();
}

// ตัดการเชื่อมต่อของเรือนที่ถูกถอดออกจากรายชื่อ (เรียกจาก applyDeviceList)
static void dropSlotByRegIdx(int regIdx) {
    for (auto& s : slots) {
        if (s.inUse && s.regIdx == regIdx) {
            Serial.printf("[LIST] %s ถูกถอดออก — ตัดการเชื่อมต่อ\n", s.macUp);
            slotCleanup(s, true);              // ส่งคำสั่งหยุดวัดก่อนแล้วค่อยตัด
            return;
        }
    }
}

static void serviceSlot(DeviceSlot& s) {
    if (!s.inUse) return;
    uint32_t now = millis();

    // หลุด (ธงจาก callback) → เก็บกวาด
    if (s.gone) { slotCleanup(s, false); return; }

// 💡 FIX: แยกเวลา Watchdog — ถ้ากำลังวัด SpO2 ให้รอได้สูงสุด 75 วิ แต่ถ้าปกติเอาแค่ 10 วิ
//   uint32_t currentWatchdogLimit = (s.phase >= PH_P2_STOPPING) ? PHASE2_TIMEOUT_MS : 10000;

    // watchdog: ไม่มีข้อมูลนานเกิน = connection ค้าง → ตัดทิ้ง (เหมือน _connection_watchdog)
    // watchdog: ไม่มีข้อมูลนานเกิน = connection ค้าง → ตัดทิ้ง
    //   ต้องแยกเพดานตามเฟส เพราะช่วงวัด SpO2 นาฬิกาอาจเงียบยาว 45-120 วิ
    //   ถ้าใช้เพดานเดียวกับ Phase 1 (15 วิ) จะตัดกลางคันทุกครั้งที่วัด SpO2
    //
    //   ช่วง Phase 2 ยังมีตัวคุมเวลาของตัวเองอยู่แล้ว (PHASE2_TIMEOUT_MS ใน PH_P2_MEASURING)
    //   watchdog ตรงนี้จึงเป็นแค่ตาข่ายชั้นสุดท้ายกันเคส connection ค้างจริงๆ
    uint32_t wdLimit = (s.phase >= PH_P2_STOPPING)
                       ? (PHASE2_TIMEOUT_MS + PHASE2_WATCHDOG_GRACE_MS)
                       : DATA_TIMEOUT_MS;

    // ถอดไว้นานเกินกำหนด → ตัดการเชื่อมต่อ คืน slot ให้เรือนที่มีคนใส่จริง
    //   ตั้ง cooldown ไว้ด้วย ไม่งั้นจะรีบต่อกลับทันทีแล้ววนซ้ำไม่จบ
    //   ระหว่าง cooldown เรายังเห็น advertisement อยู่ (รู้ว่าอยู่ในระยะ)
    //   แต่จะไม่รู้ว่ามีคนหยิบไปใส่หรือยัง จนกว่าจะต่อกลับไปอ่านอุณหภูมิ
    if (!s.isWearing && s.offWristSince != 0 &&
        now - s.offWristSince > OFFWRIST_DISCONNECT_MS) {
        Serial.printf("[OFF-WRIST] %s ถอดไว้เกิน %lu นาที → ตัดการเชื่อมต่อคืน slot\n",
                      s.macUp, (unsigned long)(OFFWRIST_DISCONNECT_MS / 60000));
        int reg = s.regIdx;                 // เก็บไว้ก่อน เพราะ slotCleanup จะล้าง slot ทิ้ง
        slotCleanup(s, true);
        // ⚠️ ต้องตั้ง cooldown "หลัง" slotCleanup เพราะข้างในมันเขียน nextAttempt
        //    เป็น +3 วินาทีเสมอ ถ้าตั้งก่อนจะโดนทับแล้วต่อกลับทันทีวนไม่จบ
        if (reg >= 0) registry[reg].nextAttempt = millis() + OFFWRIST_RECHECK_MS;
        return;
    }

    if (s.phase >= PH_PHASE1 && now - s.lastData > wdLimit) {
        Serial.printf("[WATCHDOG] %s เงียบเกิน %lu วิ (เฟส %d) → ตัดทิ้ง\n",
                      s.macUp, (unsigned long)(wdLimit / 1000), (int)s.phase);
        slotCleanup(s, true);
        return;
    }

    switch (s.phase) {
        case PH_SETUP:
            // Python: sleep 2 วิ หลัง start_notify ก่อนส่งคำสั่งแรก
            if (now - s.phaseAt >= 2000) {
                Serial.printf("[PHASE1] %s ▶️ เริ่มสตรีม HR/Temp\n", s.macUp);
                if (!writeCmd(s, {0x09, 0x01, 0x01, 0x00})) { s.gone = true; break; }
                s.phase = PH_PHASE1;
                s.phaseAt = now;
                s.lastKeepalive = now;
                s.lastBatt = 0;            // 0 = ให้ขอ battery ทันทีรอบแรก
                s.lastRssi = now;
            }
            break;

        case PH_PHASE1: {
            // keepalive 0x41 ทุก 30 วิ — กันนาฬิกาตัดเองเพราะ inactive
            if (now - s.lastKeepalive >= KEEPALIVE_INTERVAL_MS) {
                s.lastKeepalive = now;
                if (!writeCmd(s, {0x41})) { s.gone = true; break; }
            }
            // battery 0x13 ทุก 60 วิ (อัพเดตเวลาก่อนส่ง — fail จะได้ไม่ยิงรัว, เหมือน Python)
            if (now - s.lastBatt >= BATTERY_READ_INTERVAL_MS) {
                s.lastBatt = now;
                if (!writeCmd(s, {0x13, 0x00})) { s.gone = true; break; }
            }
            // RSSI ของ connection ทุก 30 วิ (ESP32 อ่านตรงจาก controller ไม่ต้องใช้ hcitool)
            if (now - s.lastRssi >= RSSI_READ_INTERVAL_MS) {
                s.lastRssi = now;
                if (s.client && s.client->isConnected()) {
                    int rssi = s.client->getRssi();
                    if (rssi != 0) publishMetric(s, K_RSSI, rssi, false);
                }
            }
            // ครบ 90 วิ → เข้า Phase 2
            if (now - s.phaseAt >= PHASE1_DURATION_MS) {
                Serial.printf("[PHASE2] %s หยุด HR/Temp เตรียมวัด SpO2\n", s.macUp);
                s.inSpo2 = true;                       // กัน off-wrist false ระหว่างวัด
                s.p2Frames = 0; s.p2Silence = 0; s.p2LastFrame = 0;
                s.p2StartedAt = now;
                if (!writeCmd(s, {0x09, 0x00, 0x00, 0x00})) { s.gone = true; break; }
                s.phase = PH_P2_STOPPING;
                s.phaseAt = now;
                s.spo2Recheck = 0;
            }
            break;
        }

        case PH_P2_STOPPING:
            if (now - s.phaseAt >= 1500) {             // Python: sleep 1.5 วิ
                s.spo2Ready = false;
                if (!writeCmd(s, {0x28, 0x03, 0x01})) { s.gone = true; break; }
                Serial.printf("[SPO2] %s 🩸 เริ่มวัด (รอบ %d)\n", s.macUp, s.spo2Recheck + 1);
                s.phase = PH_P2_MEASURING;
                s.phaseAt = now;
            }
            break;

        case PH_P2_MEASURING:
            if (s.spo2Ready || now - s.phaseAt >= PHASE2_TIMEOUT_MS) {
                uint32_t took = now - s.phaseAt;
                if (s.spo2Ready)
                    Serial.printf("[SPO2] %s ✅ ได้ค่าแล้ว ใช้เวลา %lu วิ\n",
                                  s.macUp, (unsigned long)(took / 1000));
                else
                    Serial.printf("[SPO2] %s ⏱️ หมดเวลาที่ %lu วิ\n",
                                  s.macUp, (unsigned long)(took / 1000));
                // บอกว่านาฬิกาเงียบจริงไหมระหว่างวัด — ใช้ปรับ PHASE2_WATCHDOG_GRACE_MS ให้พอดี
                Serial.printf("[SPO2] %s   ระหว่างวัดได้รับ %u frame · เงียบยาวสุด %lu วิ\n",
                              s.macUp, s.p2Frames, (unsigned long)(s.p2Silence / 1000));
                writeCmd(s, {0x28, 0x03, 0x00});       // หยุดวัด
                s.lastSpo2End = now;                   // HR Freeze เริ่มนับจากตรงนี้
                s.phase = PH_P2_ENDING;
                s.phaseAt = now;
            }
            break;

