oatchidol/NurseAid/firmware/nurseaid_esp32.ino
        case PH_P2_ENDING:
            if (now - s.phaseAt >= 1500) {
                // ตรรกะ recheck เดียวกับ Python:
                //   ไม่ได้ค่าเลย → กลับ Phase 1
                //   ค่า < 95 และยังไม่ครบ 3 รอบ → วัดซ้ำ
                //   นอกนั้น → กลับ Phase 1
                bool budgetLeft = (s.p2StartedAt == 0) ||
                                  (now - s.p2StartedAt < PHASE2_TOTAL_BUDGET_MS);
                if (!budgetLeft && s.lastSpo2 != 0 && s.lastSpo2 < SPO2_LOW_THRESHOLD)
                    Serial.printf("[SPO2] %s ครบเพดานรวม %d วิ — เลิกวัดซ้ำ กลับไปวัด HR/Temp\n",
                                  s.macUp, PHASE2_TOTAL_BUDGET_MS / 1000);

                if (budgetLeft && s.lastSpo2 != 0 && s.lastSpo2 < SPO2_LOW_THRESHOLD &&
                    s.spo2Recheck + 1 < SPO2_LOW_RECHECK_MAX) {
                    s.spo2Recheck++;
                    Serial.printf("[SPO2 LOW] %s %d%% < %d%% → วัดซ้ำ (%d/%d)\n",
                                  s.macUp, s.lastSpo2, SPO2_LOW_THRESHOLD,
                                  s.spo2Recheck, SPO2_LOW_RECHECK_MAX);
                    s.phase = PH_P2_RECHECK_WAIT;
                    s.phaseAt = now;
                } else if (s.regIdx >= 0 && registry[s.regIdx].priority != PRIORITY_HIGH) {
                    // ── priority กลาง/ต่ำ + วัดครบรอบแล้ว (ไม่ใช่ระหว่างวัดซ้ำ SpO2 ต่ำ) ──
                    //    ตัดการเชื่อมต่อไปพักตาม interval แทนวนกลับ Phase 1 ไม่จบแบบ high
                    //    เพื่อประหยัดแบตนาฬิกา (ไม่มี BLE ค้าง + ไม่มี LED PPG ทำงานระหว่างพัก)
                    int reg = s.regIdx;
                    uint32_t interval = (registry[reg].priority == PRIORITY_MEDIUM)
                                       ? PRIORITY_MEDIUM_INTERVAL_MS : PRIORITY_LOW_INTERVAL_MS;
                    Serial.printf("[PRIORITY] %s วัดครบรอบแล้ว (priority=%s) → ตัดการเชื่อมต่อ พักไป %lu นาที\n",
                                  s.macUp, PRIORITY_NAME[registry[reg].priority],
                                  (unsigned long)(interval / 60000));
                    slotCleanup(s, true, true);   // planned = พักตามรอบ ไม่ใช่หลุด
                    // ⚠️ ต้องตั้งหลัง slotCleanup เสมอ (pattern เดียวกับ OFFWRIST_RECHECK_MS
                    //    ด้านบน) เพราะข้างใน slotCleanup เขียน nextAttempt เป็น +3 วิเสมอ
                    //    ตั้งก่อนจะโดนทับแล้วต่อกลับทันทีแทนที่จะพักจริง
                    registry[reg].nextAttempt = millis() + interval;
                    return;
                } else {
                    // กลับ Phase 1
                    s.inSpo2 = false;
                    s.hrZeroStart = 0;                 // HR=0 ระหว่าง SpO2 ไม่นับ
                    Serial.printf("[PHASE1] %s ▶️ กลับมาสตรีม HR/Temp\n", s.macUp);
                    if (!writeCmd(s, {0x09, 0x01, 0x01, 0x00})) { s.gone = true; break; }
                    s.phase = PH_PHASE1;
                    s.phaseAt = now;
                }
            }
            break;

        case PH_P2_RECHECK_WAIT:
            if (now - s.phaseAt >= SPO2_LOW_RECHECK_DELAY_MS) {
                s.spo2Ready = false;
                if (!writeCmd(s, {0x28, 0x03, 0x01})) { s.gone = true; break; }
                s.phase = PH_P2_MEASURING;
                s.phaseAt = now;
            }
            break;

        default: break;
    }
}

// ═══════════════════════════════════════════════════════════════════
// WIFI + MQTT (reconnect แบบไม่ block ยาว)
// ═══════════════════════════════════════════════════════════════════
static void ensureNetwork() {
    if (WiFi.status() != WL_CONNECTED) return;         // WiFi หลุด → รอ auto-reconnect
    if (mqtt.connected()) { mqtt.loop(); return; }

    uint32_t now = millis();
    if (now - lastMqttAttempt < 5000) return;          // ลองใหม่ทุก 5 วิ
    lastMqttAttempt = now;

    char cid[40];
    snprintf(cid, sizeof(cid), "naid-%s-%06lx", NODE_ID, (unsigned long)macSuffix24());
    Serial.printf("[MQTT] เชื่อม %s:%d ...\n", activeMqttBroker.c_str(), MQTT_PORT);
    if (mqtt.connect(cid, MQTT_USER, MQTT_PASS)) {
        Serial.println("[MQTT] ✅ เชื่อมต่อแล้ว");
        {   // รายงานว่ารอบที่แล้วดับเพราะอะไร — ใช้ไล่หาสาเหตุจากที่นั่งได้เลย
            char t[64], p[220];
            snprintf(t, sizeof(t), "%s/node/%s/boot", MQTT_BASE_TOPIC, NODE_ID);
            snprintf(p, sizeof(p),
                     "{\"boot\":%lu,\"reason\":\"%s\",\"version\":\"%s\"}",
                     (unsigned long)rtcBootCount, resetReasonText(), FW_VERSION);
            mqtt.publish(t, p, true);       // retained — เปิดดูย้อนหลังได้
        }
        haveNodeList = false;                  // ให้ retained message ตัดสินใหม่ทุกครั้งที่ต่อใหม่
        sawAppRoster = false;                  // ให้ broker ใหม่ต้องพิสูจน์ตัวเองอีกครั้ง
        subscribeDeviceList();
    } else {
        Serial.printf("[MQTT] ❌ rc=%d\n", mqtt.state());
    }
}

// heartbeat ของโหนด (ของเพิ่มจากเวอร์ชัน Pi — จำเป็นเมื่อมีหลายโหนดในสนาม)
// ═══════════════════════════════════════════════════════════════════
// ble/esp32 — บอกว่า "โหนดนี้คือใคร และกำลังถือนาฬิกาเรือนไหนอยู่บ้าง"
//
//   ต่างจาก ble/node/<id> (heartbeat ทุก 60 วิ) ตรงที่ตัวนี้ส่งถี่ทุก 1 วินาที
//   และเน้นข้อมูลการจับคู่ ใช้ให้ฝั่งเซิร์ฟเวอร์รู้ว่าเรือนไหนอยู่กับโหนดไหน
//   โดยไม่ต้องรอ heartbeat รอบถัดไป
// ═══════════════════════════════════════════════════════════════════
static void publishEsp32Status() {
    static uint32_t lastSend = 0;
    uint32_t now = millis();
    if (now - lastSend < ESP32_STATUS_INTERVAL_MS) return;
    if (!mqtt.connected()) return;
    lastSend = now;

    // รวม MAC ของนาฬิกาที่กำลังเชื่อมอยู่ เป็น JSON array
    // ใช้เฉพาะ slot ที่ inUse และยังไม่ถูกตั้งธง gone (กำลังจะถูกเก็บกวาด)
    char devices[MAX_DEVICES * 21 + 4];
    int  pos = 0;
    int  count = 0;
    devices[pos++] = '[';
    for (auto& sl : slots) {
        if (!sl.inUse || sl.gone) continue;
        pos += snprintf(devices + pos, sizeof(devices) - pos,
                        "%s\"%s\"", count ? "," : "", sl.macUp);
        count++;
        if (pos >= (int)sizeof(devices) - 24) break;   // กัน buffer ล้น
    }
    devices[pos++] = ']';
    devices[pos]   = 0;

