oatchidol/NurseAid/firmware/nurseaid_esp32.ino
    char ts[24];  timeStr(ts, sizeof(ts));
    char uid[40]; makeUuid(uid);

    char topic[48];
    snprintf(topic, sizeof(topic), "%s/esp32", MQTT_BASE_TOPIC);

    char payload[MAX_DEVICES * 21 + 260];
    snprintf(payload, sizeof(payload),
             "{\"node_id\": \"%s\", \"mac\": \"%s\", \"ip\": \"%s\", "
             "\"devices\": %s, \"count\": %d, "
             "\"time\": \"%s\", \"uuid\": \"%s\"}",
             NODE_ID, WiFi.macAddress().c_str(), WiFi.localIP().toString().c_str(),
             devices, count, ts, uid);
    mqtt.publish(topic, payload);
}

static void publishHeartbeat() {
    uint32_t now = millis();
    if (now - lastHeartbeat < 60000 || !mqtt.connected()) return;
    lastHeartbeat = now;

    int links = 0;
    for (auto& s : slots) if (s.inUse) links++;
    char topic[48], payload[384];
    snprintf(topic, sizeof(topic), "%s/node/%s", MQTT_BASE_TOPIC, NODE_ID);
    snprintf(payload, sizeof(payload),
             "{\"uptime\": %lu, \"links\": %d, \"heap\": %lu, "
             "\"wifi_rssi\": %d, \"time_ok\": %d, \"boot_reason\": \"%s\", "
             "\"version\": \"%s\", \"ip\": \"%s\", "
             "\"mqtt_broker\": \"%s\", \"mqtt_port\": %d, \"max_devices\": %d}",
             (unsigned long)(now / 1000), links,
             (unsigned long)ESP.getFreeHeap(), WiFi.RSSI(), timeSynced() ? 1 : 0,
             resetReasonText(),
             FW_VERSION, WiFi.localIP().toString().c_str(),
             activeMqttBroker.c_str(), MQTT_PORT, MAX_DEVICES);
    mqtt.publish(topic, payload);
}

// ═══════════════════════════════════════════════════════════════════
// SETUP / LOOP
// ═══════════════════════════════════════════════════════════════════
void setup() {
    Serial.begin(115200);
    // ⚠️ ESP32-C3/S3 ใช้ USB แบบ native (ไม่มีชิป USB-UART แยกเหมือน WROOM)
    //    ทุกครั้งที่รีเซ็ต การเชื่อมต่อ USB จะหลุดแล้ว enumerate ใหม่
    //    ถ้าพิมพ์เร็วเกินไป ข้อความช่วงต้นจะหายหมดจนดูเหมือน "เงียบสนิท"
    //    (บน WROOM ไม่มีปัญหานี้เพราะชิป CH340 ยังเปิดพอร์ตค้างไว้)
    {   uint32_t t0 = millis();
        while (!Serial && millis() - t0 < 2000) delay(10);
    }
    delay(500);
    Serial.println("\n════════════════════════════════════════");
    Serial.println("  NAid ESP32 Node — iStyle28 port");
    resolveNodeId();     // ต้องเรียกก่อนใช้ NODE_ID และก่อนสร้าง topic ใด ๆ
    Serial.printf("  โหนด: %s | จำกัด %d เรือนพร้อมกัน\n", NODE_ID, MAX_DEVICES);
    // นับจำนวนครั้งที่รีบูต (RTC memory อยู่รอดข้ามการรีเซ็ต แต่หายเมื่อถอดไฟ)
    if (rtcMagic != RTC_MAGIC_VALUE) { rtcMagic = RTC_MAGIC_VALUE; rtcBootCount = 0; }
    rtcBootCount++;
    Serial.printf("  บูตครั้งที่ %lu · สาเหตุ: %s\n",
                  (unsigned long)rtcBootCount, resetReasonText());

    // เปิด Task Watchdog ระดับชิป — ถ้า loop() ค้าง ชิปจะรีเซ็ตตัวเอง
    // ⚠️ API ต่างกันระหว่าง Arduino ESP32 core 2.x กับ 3.x
    //    2.x : esp_task_wdt_init(uint32_t timeout_sec, bool panic)
    //    3.x : esp_task_wdt_init(const esp_task_wdt_config_t*)   ← หน่วยเป็นมิลลิวินาที
    //    และบน 3.x ตัว TWDT ถูกเปิดไว้แล้วตั้งแต่บูต การเรียก init ซ้ำจะคืน
    //    ESP_ERR_INVALID_STATE จึงต้องใช้ esp_task_wdt_reconfigure() แทน
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    esp_task_wdt_config_t twdtCfg = {
        .timeout_ms     = (uint32_t)WDT_TIMEOUT_SEC * 1000U,
        .idle_core_mask = 0,          // ไม่เฝ้า idle task — เฝ้าเฉพาะ loop ของเรา
        .trigger_panic  = true,       // ให้บันทึกสาเหตุไว้ อ่านได้ในรอบบูตถัดไป
    };
    // core 3.x เปิด TWDT ไว้ให้แล้วตั้งแต่บูต จึงลอง reconfigure ก่อน
    // (ถ้าเรียก init ก่อน ESP-IDF จะพิมพ์ error "TWDT already initialized"
    //  ออกมาทุกครั้งทั้งที่ไม่ได้ผิดอะไร ทำให้ log รกและชวนเข้าใจผิด)
    if (esp_task_wdt_reconfigure(&twdtCfg) != ESP_OK) {
        esp_task_wdt_init(&twdtCfg);          // เผื่อ core รุ่นที่ไม่ได้เปิดมาให้
    }
#else
    esp_task_wdt_init(WDT_TIMEOUT_SEC, true);
#endif
    // ⚠️ ยังไม่เรียก esp_task_wdt_add() ตรงนี้ — จะไปเรียกท้าย setup() แทน
    //    เพราะ setup() ใช้เวลานานถึง ~23 วิ (รอ WiFi 20 วิ + init BLE/mDNS)
    //    โดยไม่มีการป้อนอาหาร watchdog เลย ถ้า WiFi ช้ากว่าปกตินิดเดียว
    //    จะครบ 30 วิแล้วถูกรีเซ็ตกลางคัน → วนรีบูตไม่จบ → USB ไม่ทัน enumerate
    //    → มองจากภายนอกเหมือน "บอร์ดเงียบสนิท ไม่มี log อะไรเลย"
    Serial.printf("  Watchdog: จะเริ่มเฝ้าหลัง setup เสร็จ (timeout %d วิ)\n", WDT_TIMEOUT_SEC);
    Serial.println("════════════════════════════════════════");

    prefs.begin("naid", true);
    String confirmedBroker = prefs.getString("mqtt_broker", FIRMWARE_META.mqttBroker);
    String trialBroker     = prefs.getString("mqtt_broker_try", "");
    uint8_t trialBoots     = prefs.getUChar("mqtt_try_boots", 0);
    prefs.end();

    if (trialBroker.length() > 0 && trialBoots < BROKER_TRY_MAX_BOOTS) {
        // ⚠️ นับ "ก่อน" ลอง — ถ้าเครื่องค้างกลางทางจนถูก watchdog รีเซ็ต
        //    ตัวนับก็เดินแล้ว จึงไม่มีทางวนรีบูตไม่จบกับ broker ที่ผิด
        prefs.begin("naid", false);
        size_t counterWrote = prefs.putUChar("mqtt_try_boots", trialBoots + 1);
        prefs.end();
        if (counterWrote == 0) {
            // เขียนตัวนับไม่ได้ = ไม่มีทางรู้ว่าลองไปกี่รอบ ถ้าขืนลองต่อจะวนลอง
            // candidate เดิมทุกบูตไม่สิ้นสุด เลือกทางปลอดภัย: ไม่ทดลอง ใช้ตัวที่ยืนยันแล้ว
            activeMqttBroker = confirmedBroker;
            brokerOnTrial    = false;
            Serial.println("[MQTT] ⚠️ เขียนตัวนับ NVS ไม่ได้ → ไม่ทดลอง broker ใหม่ ใช้ตัวเดิม");
        } else {
            activeMqttBroker = trialBroker;
            brokerOnTrial    = true;
            Serial.printf("[MQTT] ทดลอง broker ใหม่ %s (ครั้งที่ %d/%d)\n",
                          trialBroker.c_str(), trialBoots + 1, BROKER_TRY_MAX_BOOTS);
        }
    } else {
        activeMqttBroker = confirmedBroker;
        if (trialBroker.length() > 0) {
            prefs.begin("naid", false);
            prefs.remove("mqtt_broker_try");
            prefs.remove("mqtt_try_boots");
            prefs.end();
            brokerRollbackPending = true;
            Serial.printf("[MQTT] broker ทดลองใช้ไม่ได้ → กลับไปใช้ %s\n", confirmedBroker.c_str());
        }
    }

    // ทะเบียนนาฬิกา — NVS ก่อน แล้วรอ MQTT ส่งรายชื่อจริงจากฐานข้อมูลมาทับ
    loadRegistryAtBoot();
    Serial.printf("ทะเบียน %d เรือน (โหนดนี้ต่อพร้อมกันได้ %d)\n", numRegistered, MAX_DEVICES);

    frameQueue = xQueueCreate(24, sizeof(BleFrame));

    // --- WiFi (ตั้งค่าผ่านหน้าเว็บด้วย WiFiManager) ---
    WiFi.mode(WIFI_STA);
    WiFi.setAutoReconnect(true);
    // บอร์ด ESP32-C3 บางล็อตเสาอากาศแมตช์ไม่ดี ส่งแรงเกินจะทำให้ไฟตกและรีบูตวน
    // ต้องเรียก "หลัง" WiFi.mode() เท่านั้น ไม่งั้นคำสั่งจะล้มเหลวเงียบ ๆ
#if CONFIG_IDF_TARGET_ESP32C3
    WiFi.setTxPower(WIFI_POWER_8_5dBm);
#endif

    // กดปุ่ม BOOT ค้างไว้ตอนเปิดเครื่อง = ล้างค่า WiFi เข้าโหมดตั้งค่า
    bool forcePortal = false;
    pinMode(WM_RESET_PIN, INPUT_PULLUP);
    if (digitalRead(WM_RESET_PIN) == LOW) {
        Serial.printf("[WiFi] ตรวจพบการกดปุ่ม — กดค้างอีก %d วิเพื่อล้างค่า WiFi ",
                      WM_RESET_HOLD_MS / 1000);
        uint32_t t0 = millis();
        while (digitalRead(WM_RESET_PIN) == LOW && millis() - t0 < WM_RESET_HOLD_MS) {
            delay(200);
            if ((millis() - t0) % 1000 < 200) Serial.print(".");
        }
        if (digitalRead(WM_RESET_PIN) == LOW) {
            forcePortal = true;
            Serial.println(" ✅ จะเข้าโหมดตั้งค่า");
        } else {
            Serial.println(" ยกเลิก (ปล่อยเร็วเกินไป)");
        }
    }

    {
        WiFiManager wm;
        wm.setDebugOutput(false);                       // ลด log รก
        wm.setConnectTimeout(WM_CONNECT_TIMEOUT_SEC);   // รอเชื่อม WiFi เดิม
        wm.setConfigPortalTimeout(WM_PORTAL_TIMEOUT_SEC);
        wm.setAPCallback([](WiFiManager* mgr) {
            Serial.println("\n╔════════════════════════════════════════════════╗");
            Serial.println("║  ยังไม่ได้ตั้งค่า WiFi — เปิดโหมดตั้งค่าแล้ว      ║");
            Serial.printf ("║  1. เชื่อม WiFi ชื่อ : %-22s ║\n", mgr->getConfigPortalSSID().c_str());
            Serial.printf ("║     รหัสผ่าน        : %-22s ║\n", WM_AP_PASSWORD);
            Serial.println("║  2. เปิดเบราว์เซอร์ไปที่ http://192.168.4.1     ║");
            Serial.println("║  3. เลือก WiFi แล้วใส่รหัส                      ║");
            Serial.println("╚════════════════════════════════════════════════╝");
        });
        wm.setSaveConfigCallback([]() {
            Serial.println("[WiFi] ✅ บันทึกค่าแล้ว");
        });

