oatchidol/NurseAid/firmware/nurseaid_esp32.ino
        // ตั้งชื่อ AP ให้ไม่ซ้ำกันเวลามีหลายโหนดเปิดพร้อมกัน
        char apName[32];
        snprintf(apName, sizeof(apName), "NAid-Setup-%06lX", (unsigned long)macSuffix24());

        // ถ้าเคยตั้งค่าไว้แล้วจะเชื่อมอัตโนมัติ
        // ถ้ายังไม่เคย (หรือ WiFi เดิมหาย) จะเปิดหน้าเว็บให้ตั้งค่า
        // ── ลองชุดที่จำไว้ทั้งหมดก่อน (รองรับ psk/open/peap/ttls) ──
        //    ถ้าโรงพยาบาลเพิ่งเปลี่ยน WiFi แต่เราเพิ่มชุดใหม่ไว้ล่วงหน้าแล้ว
        //    ตรงนี้จะเกาะชุดใหม่ได้เองโดยไม่ต้องมีใครไปตั้งค่า
        bool ok = false;
        if (!forcePortal) ok = wifiConnectFromList();

        // ── ยังไม่ติด → ลองค่าที่ฝังมากับเฟิร์มแวร์ ──
        //    จำเป็นสำหรับบอร์ดที่เพิ่งแฟลชใหม่ (NVS ว่าง)
        //    ถ้าไม่มีขั้นนี้ ทุกเครื่องที่ผลิตจะต้องเปิดมือถือตั้งค่าทีละตัว
        //    ติดแล้วจะจำลง NVS ให้ ครั้งหน้าบูตจะใช้จากรายชื่อเลย ไม่ต้องลองซ้ำ
        if (!ok && !forcePortal && strlen(WIFI_SSID) > 0) {
            Serial.println("[WiFi] ลองค่าเริ่มต้นที่ฝังมากับเฟิร์มแวร์");
            WifiCred c;
            c.ssid = WIFI_SSID;
            c.pass = WIFI_PASS;
            c.auth = (strlen(WIFI_PASS) > 0) ? AUTH_PSK : AUTH_OPEN;
            ok = wifiTryConnect(c);
            if (ok) wifiListAdd(c);
        }

        if (ok) {
            // เชื่อมได้แล้วจากรายชื่อที่จำไว้ ไม่ต้องเรียก WiFiManager
        } else if (forcePortal) {
            wm.resetSettings();
            wifiListSave("");                   // ล้างรายชื่อที่จำไว้ด้วย
            ok = wm.startConfigPortal(apName, WM_AP_PASSWORD);
        } else {
            Serial.printf("[WiFi] กำลังเชื่อมต่อ (รอสูงสุด %d วิ)...\n", WM_CONNECT_TIMEOUT_SEC);
            ok = wm.autoConnect(apName, WM_AP_PASSWORD);
        }

        if (ok) {
            // จำชุดที่ใช้ได้ไว้ เผื่อวันหลังมีชุดอื่นเพิ่มเข้ามา
            if (WiFi.SSID().length() > 0) {
                WifiCred c;
                c.ssid = WiFi.SSID();
                c.pass = WiFi.psk();
                c.auth = c.pass.length() ? AUTH_PSK : AUTH_OPEN;
                wifiListAdd(c);        // หน้าเว็บตั้งได้แค่ PSK/open
            }
            Serial.printf("[WiFi] ✅ %s  IP: %s  RSSI: %d dBm\n",
                          WiFi.SSID().c_str(), WiFi.localIP().toString().c_str(), WiFi.RSSI());
        } else {
            // หมดเวลารอแล้วไม่มีใครมาตั้งค่า → รีบูตไปเริ่มใหม่
            // ดีกว่าปล่อยให้ค้างอยู่เฉย ๆ โดยไม่มีใครรู้
            Serial.println("[WiFi] ⚠️ ตั้งค่าไม่สำเร็จ — รีบูตเพื่อลองใหม่");
            Serial.flush();
            delay(1000);
            ESP.restart();
        }
    }   // ปล่อย WiFiManager ทิ้งตรงนี้ คืน RAM ก่อนเริ่ม BLE

    // ⚠️ configTime() เป็นคำสั่งแบบ "สั่งแล้วจบ" ไม่ได้รอให้ sync เสร็จ
    //    การ sync จริงใช้เวลา 1-10 วินาที ถ้าไม่รอ ข้อความช่วงแรกจะได้เวลาปี 1970
    configTime(TZ_OFFSET_SEC, 0, NTP_SERVER1, NTP_SERVER2);
    // ตั้ง TZ ให้ชัดเจนอีกชั้น กันกรณี configTime ถูกเรียกซ้ำแล้ว offset หาย
    setenv("TZ", "ICT-7", 1);      // ไทย UTC+7 ไม่มี DST
    tzset();

    if (WiFi.status() == WL_CONNECTED) {
        Serial.print("[NTP] เทียบเวลา ");
        uint32_t t0 = millis();
        while (!timeSynced() && millis() - t0 < NTP_SYNC_TIMEOUT_MS) {
            delay(250);
            if ((millis() - t0) % 1000 < 250) Serial.print(".");
        }
        if (timeSynced()) {
            char ts[24]; timeStr(ts, sizeof(ts));
            Serial.printf(" ✅ %s\n", ts);
        } else {
            Serial.printf(" ⚠️ ไม่สำเร็จใน %d วิ — จะเทียบใหม่ในพื้นหลัง\n",
                          NTP_SYNC_TIMEOUT_MS / 1000);
            Serial.println("     (เครือข่ายอาจบล็อก NTP พอร์ต 123 — ดูหมายเหตุใน README)");
        }
    }

    // --- MQTT ---
    // ⚠️ PubSubClient::setServer(const char*, ...) เก็บ pointer ไม่ copy string
    //    activeMqttBroker เป็น global String จึงอยู่รอด — แต่ห้าม assign ค่าใหม่
    //    ทับตัวแปรนี้ตอน runtime โดยไม่เรียก setServer() ใหม่ (pointer จะชี้ขยะ)
    mqtt.setServer(activeMqttBroker.c_str(), MQTT_PORT);
    mqtt.setCallback(mqttCallback);        // รับรายชื่อ MAC + คำสั่งควบคุม

    // ArduinoOTA/mDNS เริ่มได้ต่อเมื่อ WiFi ติดแล้วเท่านั้น
    // ถ้าตอนบูต WiFi ยังไม่ติด จะไปเริ่มให้ใน loop() แทน (ดู otaReady)
    // ต้องพอสำหรับ payload ที่ยาวที่สุด = ble/esp32 ตอนเชื่อมครบทุกเรือน
    //   (~336 ไบต์ที่ 8 เรือน) + topic + header ของ MQTT
    //   ⚠️ ถ้าเล็กเกิน PubSubClient จะ "ทิ้งข้อความเงียบ ๆ" ไม่มี error ให้เห็น
    mqtt.setBufferSize(MAX_DEVICES * 24 + 384);
    mqtt.setKeepAlive(30);          // เผื่อช่วง connect BLE ที่ block ~15 วิ
    mqtt.setSocketTimeout(5);

    // --- BLE ---
    NimBLEDevice::init("");
    // ⚠️ ยืนยันแล้วด้วยการทดสอบจริง (debug session นี้): เคยลองดันขึ้น 20dBm
    //    (สูงสุดที่รองรับ) เพื่อดูว่าช่วยเรื่อง RSSI อ่อนไหม — ผลคือ:
    //      • RSSI ที่นาฬิกาส่งมาไม่เปลี่ยนเลย (คนละทิศทางกับ TX power ฝั่งนี้ ตามคาด)
    //      • ~74 วิหลังเริ่มสตรีม เจอ "[BLE] ... หลุด (reason=520)" = HCI 0x08
    //        Connection Timeout จริง — เป็น disconnect โดยไม่ตั้งใจครั้งแรกในเซสชันทั้งหมด
    //        (ตอน 9dBm ไม่เคยหลุดเองเลยแม้ทดสอบต่อเนื่อง 8+ นาที)
    //    สรุป: 20dBm ไม่ช่วย RSSI แถมกลับไปเจอ disconnect ตรงกับที่สงสัยไว้เรื่อง
    //    กระแสพีค/brownout บนบอร์ดล็อตที่เสาอากาศแมตช์ไม่ดี — คืนกลับ 9dBm ถาวร
    //    (ตัวเลขเดียวกับที่ลด WiFi ไปแล้วด้วยเหตุผลเดียวกัน — WIFI_POWER_8_5dBm)
    NimBLEDevice::setPower(9);
    NimBLEDevice::setMTU(185);      // ⚠️ สำคัญมาก: frame 0x09 ยาว 25 ไบต์
                                    //    MTU default 23 จะรับได้แค่ 20 ไบต์ → parse พัง
                                    //    (บน Pi BlueZ ต่อรอง MTU ให้เองเลยไม่เคยเจอ)
    NimBLEScan* scan = NimBLEDevice::getScan();
    scan->setScanCallbacks(&scanCB, true);   // true = แจ้ง advertisement ซ้ำด้วย (อัพเดต lastSeen)
    scan->setActiveScan(false);              // passive พอ (เราจับด้วย MAC) — เบากับ coexistence
    scan->setInterval(160);                  // 100 ms  (หน่วย 0.625 ms)
    scan->setWindow(96);                     //  60 ms  — window < interval เสมอ เว้นช่วงให้ WiFi
    scan->setMaxResults(0);                  // ไม่เก็บผลในหน่วยความจำ (ใช้ callback อย่างเดียว)

    Serial.println("[BLE] พร้อม เริ่มค้นหานาฬิกา\n");

    // เริ่มให้ watchdog เฝ้า "หลัง" setup เสร็จเรียบร้อยแล้วเท่านั้น
    // ตั้งแต่บรรทัดนี้ไป loop() ต้องกลับมาป้อนอาหารทุก ๆ ไม่เกิน WDT_TIMEOUT_SEC วิ
    esp_task_wdt_add(NULL);
    esp_task_wdt_reset();
    Serial.printf("[WDT] เริ่มเฝ้า loop แล้ว (timeout %d วิ)\n", WDT_TIMEOUT_SEC);
}

void loop() {
    esp_task_wdt_reset();                  // ป้อนอาหาร watchdog ทุกรอบ

    // เริ่ม ArduinoOTA ครั้งแรกที่ WiFi ติด (อาจติดหลัง setup จบไปแล้ว)
    if (!otaReady && WiFi.status() == WL_CONNECTED) {
        char mdnsName[32];
        snprintf(mdnsName, sizeof(mdnsName), "naid-%s", NODE_ID);
        MDNS.begin(mdnsName);
        setupArduinoOTA();
        otaReady = true;
    }
    if (otaReady) ArduinoOTA.handle();      // ต้องเรียกบ่อย ไม่งั้น espota ต่อไม่ติด

    // ระหว่างอัปเดตเฟิร์มแวร์ หยุดทุกอย่าง ห้ามยุ่งกับ BLE/MQTT
    if (otaBusy) { esp_task_wdt_reset(); delay(10); return; }

    // ── ชั้นที่ 2: เน็ตหลุดยาวเกินกำหนด = รีบูต ──
    //    ครอบคลุมเคสที่ชิปไม่ค้าง (watchdog จึงไม่ทำงาน) แต่ WiFi/MQTT stack
    //    เอ๋อจนต่อไม่ติดอีกเลย ซึ่งเป็นอาการที่พบบ่อยกว่าการค้างทั้งเครื่อง
    static uint32_t lastNetOk = 0;
    if (lastNetOk == 0) lastNetOk = millis();
    if (WiFi.status() == WL_CONNECTED && mqtt.connected()) lastNetOk = millis();
    else if (millis() - lastNetOk > NET_DEAD_REBOOT_MS) {
        Serial.printf("[SYS] เน็ตหลุดเกิน %lu นาที → รีบูตเพื่อกู้ตัวเอง\n",
                      (unsigned long)(NET_DEAD_REBOOT_MS / 60000));
        Serial.flush();
        ESP.restart();
    }

    // ── broker ทดลอง: ต่อติดต่อเนื่องนานพอ = ยืนยันเป็นตัวหลัก ──
    //    ที่ต้องรอต่อเนื่อง ไม่ใช่แค่ connect ติดครั้งเดียว เพราะ broker
    //    "ที่ผิดแต่มีอยู่จริง" ในเครือข่ายอาจตอบ CONNACK ให้ได้
    if (brokerOnTrial) {
        // ── เพดานเวลาทดลอง ──
        //    broker ที่ติด ๆ หลุด ๆ จะรีเซ็ต brokerOkSince ตลอดจนไม่เคยครบ
        //    BROKER_CONFIRM_MS ในขณะที่ lastNetOk ก็ถูกรีเฟรชจนชั้น net-dead
        //    ไม่ยิง → ค้างสถานะทดลองไม่จบ ตัดบทด้วยเพดานเวลาแทน
        if (millis() >= BROKER_TRIAL_DEADLINE_MS) {
            prefs.begin("naid", false);
            prefs.remove("mqtt_broker_try");
            prefs.remove("mqtt_try_boots");
            prefs.end();
            brokerOnTrial = false;
            nlog("[MQTT] broker ทดลองไม่ผ่านใน %lu นาที → ถอยกลับตัวเดิมแล้วรีบูต",
                 (unsigned long)(BROKER_TRIAL_DEADLINE_MS / 60000));
            publishOtaStatus("broker_rollback", "ทดลองไม่ผ่านตามเวลาที่กำหนด");
            pendingRebootAt = millis() + 2000;   // รีบูตเพื่อกลับไปใช้ broker ที่ยืนยันแล้ว
        // ต้องมีทั้ง "ต่อติด" และ "ได้รายชื่อจากแอปเรา" — connected อย่างเดียว
        // พิสูจน์แค่ว่ามี broker ตัวหนึ่งรับ connection ไม่ได้พิสูจน์ว่าเป็นตัวที่ถูก
        } else if (mqtt.connected() && sawAppRoster) {
            if (brokerOkSince == 0) brokerOkSince = millis();
            else if (millis() - brokerOkSince >= BROKER_CONFIRM_MS) {
                prefs.begin("naid", false);
                size_t wrote = prefs.putString("mqtt_broker", activeMqttBroker);
                if (wrote > 0) {
                    prefs.remove("mqtt_broker_try");
                    prefs.remove("mqtt_try_boots");
                }
                prefs.end();
                if (wrote > 0) {
                    brokerOnTrial = false;
                    nlog("[MQTT] ✅ ยืนยัน broker %s เป็นตัวหลักแล้ว", activeMqttBroker.c_str());
                    publishOtaStatus("broker_ok", activeMqttBroker.c_str());
                } else {
                    // เขียน NVS ไม่ผ่าน — คงสถานะทดลองไว้ เดี๋ยวรอบหน้าลองยืนยันใหม่
                    brokerOkSince = 0;
                    nlog("[MQTT] ⚠️ เขียน NVS ไม่สำเร็จ — ยังไม่ยืนยัน broker");
                }
            }
        } else {
            brokerOkSince = 0;      // หลุด → เริ่มนับใหม่
        }
    }
    // แจ้งครั้งเดียวตอนต่อ broker ทดลองติด — เส้นทาง OTA รีบูตมาแล้วยังไม่เคยแจ้ง
    // ทำให้ UI ไม่เห็นสถานะ "กำลังทดลอง" เลยตลอดช่วง 2-15 นาทีที่รอผล
    if (brokerOnTrial && !brokerTrialAnnounced && mqtt.connected()) {
        brokerTrialAnnounced = true;
        publishOtaStatus("broker_trial", activeMqttBroker.c_str());
    }
    if (brokerRollbackPending && mqtt.connected()) {
        brokerRollbackPending = false;
        publishOtaStatus("broker_rollback", activeMqttBroker.c_str());
    }

    // ── ชั้นที่ 3: รีบูตตามรอบ (รอจังหวะที่ไม่มีเรือนเชื่อมอยู่) ──
#if AUTO_REBOOT_HOURS > 0
    if (millis() > (uint32_t)AUTO_REBOOT_HOURS * 3600000UL) {
        int links = 0;
        for (auto& s : slots) if (s.inUse) links++;
        if (links == 0) {
            Serial.printf("[SYS] ครบรอบ %d ชม. — รีบูตตามกำหนด\n", AUTO_REBOOT_HOURS);
            Serial.flush();
            ESP.restart();
        }
    }
#endif

