oatchidol/NurseAid/firmware/nurseaid_esp32.ino
    if (pendingRebootAt != 0 && millis() >= pendingRebootAt) {
        Serial.println("[SYS] รีบูตตามคำสั่ง");
        Serial.flush();
        ESP.restart();
    }

    ensureNetwork();

    // ประมวลผล frame จากคิว (BLE callback → ที่นี่)
    BleFrame f;
    while (xQueueReceive(frameQueue, &f, 0) == pdTRUE) {
        if (f.slot < MAX_DEVICES && slots[f.slot].inUse) {
            processFrame(slots[f.slot], f.data, f.len);
        }
    }

    for (auto& s : slots) serviceSlot(s);
    tryConnectNext();
    manageScan();
    // เทียบเวลาใหม่เป็นระยะ — นาฬิกาภายในชิปดริฟต์ได้หลายวินาทีต่อวัน
    // และถ้าตอนบูต NTP ไม่ผ่าน ตรงนี้จะเป็นโอกาสให้ sync สำเร็จภายหลัง
    {
        static uint32_t lastNtp = 0;
        if (WiFi.status() == WL_CONNECTED &&
            (lastNtp == 0 || millis() - lastNtp > NTP_RESYNC_INTERVAL_MS)) {
            lastNtp = millis();
            configTime(TZ_OFFSET_SEC, 0, NTP_SERVER1, NTP_SERVER2);
        }
    }

    publishHeartbeat();
    publishEsp32Status();
    reportActiveList();

    // log สรุปทุก 30 วิ
    if (millis() - lastStatusLog >= 30000) {
        lastStatusLog = millis();
        int links = 0;
        for (auto& s : slots) if (s.inUse) links++;
        Serial.printf("[STATUS] เชื่อม %d/%d | WiFi %s | MQTT %s | heap %lu\n",
                      links, MAX_DEVICES,
                      WiFi.status() == WL_CONNECTED ? "✅" : "❌",
                      mqtt.connected() ? "✅" : "❌",
                      (unsigned long)ESP.getFreeHeap());
    }

    delay(10);      // ปล่อยเวลาให้ task อื่น (NimBLE/WiFi) — loop ยังไวพอสำหรับ FSM
}
